[ {
  "title" : "Bench Press",
  "description" : "This is an exercise for the chest.",
  "types" : [ "compound" ],
  "steps" : [ "Lie on a flat bench with your feet flat on the floor, keep your back flat on the bench.", "Grasp the bar a little wider than shoulder width apart.", "Raise the barbell above your body and move it over the middle of your chest, this is your starting position.", "Lower the bar down so it just touches your chest.", "Raise the bar till your arms are fully extended and your elbows are locked.", "Return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "barbell", "bench" ],
  "images" : [ "\"bench-press-medium-1.png\"", "\"bench-press-medium-2.png\"" ]
}, {
  "title" : "Supermans",
  "description" : "This is an excellent exercise and a stretch for the lower back and core muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on your stomach with your arms stretched out in front of you.", "Raise your arms and legs off the floor and hold this position for 2 seconds.", "Return to the starting position on the floor.", "Repeat." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "core" ],
  "equipment" : [ "body" ],
  "images" : [ "\"supermans-medium-1.png\"", "\"supermans-medium-2.png\"" ]
}, {
  "title" : "Push Ups",
  "description" : "This exercise is the main strengthening exercise when wanting to strengthen ones chest, biceps and triceps as well as core muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Start with a basic push up, lay face down on the floor, or a mat; with your feet together curled slightly so you rise onto the ball of your feet.", "Place you hands shoulder width apart on the either side of your chest.", "Draw your abs in.", "Inhale as you raise your body up till your arms are straight.", "Keep your head and neck level with your body (don’t look up or down) and don’t allow your back to rise or fall.", "Exhale out as you lower your body back to the ground.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "body" ],
  "images" : [ "\"push-ups-medium-1.png\"", "\"push-ups-medium-2.png\"" ]
}, {
  "title" : "Pull Ups",
  "description" : "This is an exercise in lats, biceps and middle back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grab the pull-up bar with the palms facing forward using the prescribed grip.", "As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.", "Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement.", "After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.", "Repeat this motion." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps", "middle back" ],
  "equipment" : [ "bar" ],
  "images" : [ "\"pull-ups-medium-1.png\"", "\"pull-ups-medium-2.png\"" ]
}, {
  "title" : "Bridging",
  "description" : "This is an excellent exercise for strengthening and maintaining the core muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on your back with your knees bent and your feet flat on the floor.", "Lift up hips and bum off the floor as you draw your abs in and keep your gluts tight." ],
  "primaryMusclGroup" : [ "gluts" ],
  "secondaryMuscleGroup" : [ "core" ],
  "equipment" : [ "body" ],
  "images" : [ "\"bridging-medium-1.png\"", "\"bridging-medium-2.png\"" ]
}, {
  "title" : "Chin Ups",
  "description" : "This is an extremely good exercise for upper arm and middle back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp the bar with an supinated (overhand) grip.", "Let your body hang from the bar with your arms straight.", "Slowly pull yourself up so that your chin is higher than the bar.", "With a controlled movement lower yourself to the starting position." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps", "middle back" ],
  "equipment" : [ "bar", "body" ],
  "images" : [ "\"chin-ups-medium-1.png\"", "\"chin-ups-medium-2.png\"" ]
}, {
  "title" : "Seated Military Press",
  "description" : "An exercise for the shoulder and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the bench with your toes pointing straight out, back straight and abs drawn in.", "Grip the bar with your palms facing outwards and your hands shoulder width apart", "With bar in front of your head, press upwards extending your arms but not locking them.", "Pause at the top and then in a controlled movement lower the bar to the starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "barbell", "bench" ],
  "images" : [ "\"seated-military-press-medium-1.png\"", "\"seated-military-press-medium-2.png\"" ]
}, {
  "title" : "Close Grip Barbell Bench Press",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with your feet flat on the floor, keep your back flat on the bench.", "Grasp the bar a close grip (approximately 14” apart).", "Raise the barbell above your body and move it over the middle of your chest, this is your starting position.", "Lower the bar down so it just touches your chest.", "Raise the bar till your arms are fully extended and your elbows are locked.", "Return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"close-grip-barbell-bench-press-medium-1.png\"", "\"close-grip-barbell-bench-press-medium-2.png\"" ]
}, {
  "title" : "Arnold Press",
  "description" : "An exercise for shoulder and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on a flat bench, feet point forward with your abs drawn in.", "Grasp a dumbbell in each hand with your palm facing towards your body", "Bend your elbows to 90 degrees and raise both your arms to the starting point in line with your shoulders.", "With a steady controlled motion raise your arms up while straightening your elbows while rotating your forearms so that your palms now face away from your body.", "Bring the dumbbells closer together but do not fully extend your elbows.", "With a controlled motion lower the dumbbells to the starting position at your shoulders." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"arnold-press-medium-1.png\"", "\"arnold-press-medium-2.png\"" ]
}, {
  "title" : "Side Plank",
  "description" : "This is an exercise for core strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay on one side of your body with your legs straight and your forearm perpendicular to your body in front of you.", "Drawing your abs in, slowly raise yourself up so you are balanced on your feet and your forearm.", "Hold this position and slowly return back to the starting position.", "Repeat on other side." ],
  "primaryMusclGroup" : [ "core" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"side-plank-medium-1.png\"", "\"side-plank-medium-2.png\"" ]
}, {
  "title" : "Standing Leg Curls",
  "description" : "This is an exercise for hamstring strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Standing at a leg curl machine adjust the rear footpad so it is just above your ankle.", "Grasp the handles of the machine for support and draw your abs in.", "Raise your foot up towards your back slowly.", "Return to the starting position and chance legs." ],
  "primaryMusclGroup" : [ "hamstrings" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"standing-leg-curls-medium-1.png\"", "\"standing-leg-curls-medium-2.png\"" ]
}, {
  "title" : "Incline Shoulder Press Dumbbell",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie down on an incline bench with your feet flat on the floor and grasp the dumbbells.", "With your elbows bent raise your arms up until in line with your shoulders this is your starting position.", "With your abs drawn in, raise the dumbbells as high as you are able above your shoulders.", "Lower the dumbbells in a slow controlled manner to starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"incline-shoulder-press-dumbbell-medium-1.png\"", "\"incline-shoulder-press-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Incline Dumbbell Press",
  "description" : "This exercises is for mainly chest strengthening but also strengthens your triceps and shoulders.",
  "types" : [ "isolation" ],
  "steps" : [ "Set and incline bench at a 45 degree angle.", "Start with the dumbbells at shoulder height, your arms wide and elbows pointing down to the floor.", "Raise your arms up over your chest bringing the dumbbells closer together as they meet over your chest.", "Slowly return the dumbbells to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "dumbbells", "incline bench" ],
  "images" : [ "\"incline-dumbbell-press-medium-1.png\"", "\"incline-dumbbell-press-medium-2.png\"" ]
}, {
  "title" : "Upright Barbell Rows",
  "description" : "This is an exercise for shoulder, biceps and upper back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your abs drawn in and back straight.", "Place the bar on rack in the position where your arms are fully extended in front of you with your elbows slightly bent.", "Place your hands shoulder width apart and raise the bar up towards your chin with a controlled motion.", "Pause at the top for a moment and rotate your shoulder blades together.", "Lower the bar to the starting position.", "Repeat" ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps", "upper back" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"upright-barbell-rows-medium-1.png\"", "\"upright-barbell-rows-medium-2.png\"" ]
}, {
  "title" : "Bench Press Dumbbell",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp the dumbbells in each hand and lie on a flat bench with your feet firmly on the ground.", "Extend your arms up over your chest with your palms facing forwards.", "Press the dumbbells up over your chest till your arm are fully extended this is your starting position.", "Bend your elbows to a 90 degree angle so your upper arms are parallel with the floor.", "Slowly lower the dumbbells as low as comfortable along your chest.", "With a controlled motion return back to your starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "dumbbells", "flat bench" ],
  "images" : [ "\"bench-press-dumbbell-medium-1.png\"", "\"bench-press-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Incline Bench Press",
  "description" : "This is an exercise for chest and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on an incline bench set at a 45 degree angle, with your feet shoulder width apart.", "Grasp the bar a little wider than shoulder width apart.", "Raise the barbell above your body and move it over the middle of your chest, this is your starting position.", "Lower the bar down so it just touches your chest.", "Raise the bar straight up till your arms are fully extended and your elbows are locked.", "Return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "barbell", "incline bench" ],
  "images" : [ "\"incline-bench-press-medium-1.png\"", "\"incline-bench-press-medium-2.png\"" ]
}, {
  "title" : "Shoulder Shrugs",
  "description" : "An exercise for trapezius strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart and a slight bend in your knees.", "Hold a dumbbell in each hand and with your arms at your sides.", "Lower your shoulders as much as possible.", "With your arms straight raise both shoulders up towards your ears.", "Hold the upright positions for a moment and then lower in a controlled motion." ],
  "primaryMusclGroup" : [ "trapezius" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"shoulder-shrugs-medium-1.png\"", "\"shoulder-shrugs-medium-2.png\"" ]
}, {
  "title" : "Wide Grip Decline Bench Press",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a decline bench with your head lower than your feet.", "Place your hands wider than shoulder width apart on the bar and lift it off the rack.", "Bring the bar over your chest and lower it till it is just above the lower portion of your chest, this is starting position.", "Extend your arms upward and raise the bar straight up.", "Pause for a moment and then lower the bar to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "barbell", "decline bench" ],
  "images" : [ "\"wide-grip-decline-bench-press-medium-1.png\"", "\"wide-grip-decline-bench-press-medium-2.png\"" ]
}, {
  "title" : "Hack Squat Machine",
  "description" : "This exercise is a variation of the Squat which uses a machine.  This exercise may be preferred by beginners.",
  "types" : [ "compound" ],
  "steps" : [ "Lie face up on a Hack Squat machine with your shoulders against the pad.", "Place your feet facing forward at slightly less than shoulder width apart with your toes point slightly outward.", "Release the dock levers and place your hands on the hand grips.", "Drawing your abs in, extend your body standing upright.", "Lower your body to a squatting position so you knees are bent as if you were sitting down.", "Return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"hack-squat-machine-medium-1.png\"", "\"hack-squat-machine-medium-2.png\"" ]
}, {
  "title" : "T-Bar Rows",
  "description" : "This is an exercise for middle back, biceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place your feet on either side of a T-Bar Machine.", "With your knees slightly bent and abs drawn in, grasp the handles with a narrow grip.", "Bend at the waist so your chest is parallel to the floor, this is starting position. Slowly pull the bar to your chest, as high as you can.", "Pause at the top for a moment and then lower the bar to starting position.", "Repeat" ],
  "primaryMusclGroup" : [ "middle back" ],
  "secondaryMuscleGroup" : [ "biceps", "shoulders" ],
  "equipment" : [ "t-bar machine" ],
  "images" : [ "\"t-bar-rows-medium-1.png\"", "\"t-bar-rows-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Shoulder Press",
  "description" : "An exercise for shoulder, chest and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sitting on a bench, with your abs drawn in grasp a dumbbell in each hand, with your palms facing forward.", "Begin with your arms at the height of your shoulders.", "Extend your arms and raise the dumbbells up above your head.", "At the top of the movement, bring your arms closer together.", "Pause for a moment and then in a controlled movement lower the dumbbells to the starting position.", "Repeat" ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "chest", "triceps" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"dumbbell-shoulder-press-medium-1.png\"", "\"dumbbell-shoulder-press-medium-2.png\"" ]
}, {
  "title" : "Cable Crossover",
  "description" : "This is an exercise for chest and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach the cable pulley to shoulder height.", "Grasp the pulley in both hands and stand approximately one foot in front of the weight stacks, with one foot slightly in front of the other.", "With a slight bend in your elbows bring your hand together in front of your chest on downward angle.", "When your hands meet at the midpoint of your chest, hold for a moment.", "With a slow controlled motion return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"cable-crossover-medium-1.png\"", "\"cable-crossover-medium-2.png\"" ]
}, {
  "title" : "Barbell Squat",
  "description" : "This is an exercise for leg strengthening, mainly the quadriceps.",
  "types" : [ "compound" ],
  "steps" : [ "Lifting a barbell off of a weight rack, position it on your shoulders.", "Place your feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"barbell-squat-medium-1.png\"", "\"barbell-squat-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Flys",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with a dumbbell in each hand and your feet firmly on the ground.", "Lift the dumbbells over your chest extending your arms fully with a slight bend in your elbows, this is your starting position.", "Keeping a slight bend in your elbows, lower the dumbbells to the floor in an arc like motion.", "Slowly return the dumbbells over your chest to the starting position in a controlled motion.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "dumbbells", "flat bench" ],
  "images" : [ "\"dumbbell-flys-medium-1.png\"", "\"dumbbell-flys-medium-2.png\"" ]
}, {
  "title" : "Chest Dips",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand in between the parallel bars.", "Grip the handles of the parallel bars and push yourself up to the starting position with straightened arms.", "With your elbows close to your body keep your hips straight, lower your body forward by bending your elbows so your chest is leading as you go down.", "Raise yourself back up to the starting position and repeat.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "body", "parallel bars" ],
  "images" : [ "\"chest-dips-medium-1.png\"", "\"chest-dips-medium-2.png\"" ]
}, {
  "title" : "Machine Bench Press",
  "description" : "This is an exercise for chest, biceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the machine so that you are sitting with the bars at chest height.", "Place your hands on the bars and place your feet on the foot rest.", "Press out, extending your arms as far as possible in a steady motion.", "Pause for a moment and then return slowly to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "bench press machine" ],
  "images" : [ "\"machine-bench-press-medium-1.png\"", "\"machine-bench-press-medium-2.png\"" ]
}, {
  "title" : "Hyperextensions",
  "description" : "This exercise not only adds strength but also flexibility to the back and core muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the hyperextension bench so that your ankles are tucked under the footpads and your thighs are flat across the top pad.", "With your arms folded across your chest and your back straight, slowly bend at the waist towards the floor, keeping your back flat.", "Slowly return to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "core", "hamstrings" ],
  "equipment" : [ "hyperextension bench" ],
  "images" : [ "\"hyperextensions-medium-1.png\"", "\"hyperextensions-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Dead Lifts",
  "description" : "This is an exercise for lower back, hamstring and calves strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp 2 dumbbells and stand with your feet shoulder width apart.", "Keeping your back straight bend at the waist, allow some bend in your knees.", "Grasp the dumbbells with an overhand grip in each hand.", "Straighten your back as you hold the dumbbells at arm’s length.", "Bend over again lowering the dumbbells to just above the floor.", "Return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "calves", "hamstring" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"dumbbell-dead-lifts-medium-1.png\"", "\"dumbbell-dead-lifts-medium-2.png\"" ]
}, {
  "title" : "Front Raises",
  "description" : "This is an exercise for shoulder, chest and forearm strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, abs drawn in and knees slightly bent.", "Grasp a dumbbell in each hand, with your palm facing down.", "Start with the dumbbell at waist height.", "Raise your left arm, keeping your elbow slightly bent and your arm straight, to in line with your shoulder.", "Pause for a moment and with a controlled motion lower your arm to back to the starting position at your waist.", "Repeat with your right arm." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "chest", "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"front-raises-medium-1.png\"", "\"front-raises-medium-2.png\"" ]
}, {
  "title" : "Front Cable Raises",
  "description" : "An exercise for shoulders, chest and forearm strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place the pulley on the setting just above the floor.", "Stand with your feet shoulder width apart, your abs drawn in and your knees slightly bent.", "Starting at waist height, take the pulley in your left hand, palm facing the floor with otherwise known as an overhand grip, and raise your straight arm up towards your left shoulder.", "At shoulder height pause for a moment.", "With a controlled movement resist the weight and slowly lower your arm back to starting position at your waist.", "Repeat the exercise with your right arm." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "chest", "forearm" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"front-cable-raises-medium-1.png\"", "\"front-cable-raises-medium-2.png\"" ]
}, {
  "title" : "Front Barbell Raises",
  "description" : "An exercise for shoulder, chest and forearm strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a barbell with an overhand grip(palms of hands face downwards) .", "Stand up-right with your feet shoulder width apart, knees slightly bent and your abs drawn in.", "With your arms straight, raise the barbell in a controlled motion to shoulder level.", "Hold for a moment and then lower the barbell in at the same motion." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "chest", "forerm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"front-barbell-raises-medium-1.png\"", "\"front-barbell-raises-medium-2.png\"" ]
}, {
  "title" : "Seated Shoulder Press Machine",
  "description" : "This is an exercise for the shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit upright with your back supported by the chair and draw your abs in.", "Place your hands on the bars and with smooth even motions press upward extending your arms, but not locking them.", "At the top pause then with controlled motion lower the bars to your starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"seated-shoulder-press-machine-medium-1.png\"", "\"seated-shoulder-press-machine-medium-2.png\"" ]
}, {
  "title" : "Barbell Shrugs",
  "description" : "This is an exercise for trapezius strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand on the floor with your abs drawn in and your back straight.", "Grasp a barbell with a grip a little wider than shoulder width at arms length.", "Drop your shoulders as much as possible to start.", "Raise your shoulder as high as possible.", "Pause for a moment at the top and then return to starting position in a controlled motion.", "Repeat." ],
  "primaryMusclGroup" : [ "trapezius" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"barbell-shrugs-medium-1.png\"", "\"barbell-shrugs-medium-2.png\"" ]
}, {
  "title" : "One Arm Upright Row",
  "description" : "This is an exercise for shoulder and trapezius strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand near a post or other stable tall object. With your one hand, hold the post.", "Grasp the dumbbell in your other hand with a pronated grip (palms facing backwards).", "Place the dumbbell in front of your thigh, this is starting position.", "Lift the dumbbell upward to your shoulder with your elbow pointing away from your body in a rowing motion.", "Lower your arm to starting position and repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "trapezius" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"one-arm-upright-row-medium-1.png\"", "\"one-arm-upright-row-medium-2.png\"" ]
}, {
  "title" : "Flat Bench Leg Raises",
  "description" : "This is an exercise for lower abdominal strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with your hands under your hips supporting your back.", "Your legs should be unsupported by the bench from below your knees.", "With your feet together and your toes flexed upwards, raise your straight legs up a few cm off the bench; both of your legs should have no contact with the bench. This is your starting position.", "Keep your legs straight with a slight bend in the knees and raise your legs to just before 90 degrees with your hips.", "Pause at the top and lower your legs in slow controlled manner back to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lower abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"flat-bench-leg-raises-medium-1.png\"", "\"flat-bench-leg-raises-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Shoulder Shrugs",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place the barbell at waist height.", "Stand with your feet shoulder width apart and your abs drawn in.", "Grasp the bar with an overhand grip and straightened arms.", "As you lift the bar allow the weight to pull your shoulders down, shrug your shoulders up and to the back.", "Hold for a moment and then return to starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-shoulder-shrugs-medium-1.png\"", "\"smith-machine-shoulder-shrugs-medium-2.png\"" ]
}, {
  "title" : "Seated Barbell Shoulder Press",
  "description" : "This is an exercise for shoulder, chest and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sitting on a bench with a barbell rack, grasp the barbell with a grip 3 to 4 inches wider than your shoulders.", "Lift the bar off the rack and lower it to just at the height of your shoulders.", "While maintaining  good posture, straighten your arms and raise the bar up above your head.", "Pause for a moment and then in a controlled movement lower the bar to the starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "chest", "triceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"seated-barbell-shoulder-press-medium-1.png\"", "\"seated-barbell-shoulder-press-medium-2.png\"" ]
}, {
  "title" : "Flat Bench Cable Flys",
  "description" : "This is an exercise for chest and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on flat bench between two cable towers and your feet firmly on the ground.", "Grasp a pulley in each hand with your palms facing up.", "With a slight bend in your elbows, squeeze your chest and pull the cables together meeting in the middle of your chest.", "Hold for a moment and then slowly lower your hands back to starting position at bench height." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "cable machine", "flat bench" ],
  "images" : [ "\"flat-bench-cable-flys-medium-1.png\"", "\"flat-bench-cable-flys-medium-2.png\"" ]
}, {
  "title" : "Body Row",
  "description" : "This is a good overall exercise which strengthens your chest, core and back muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Lie under a bar so that the bar is at mid chest level and your feet are firmly on the floor.", "Draw your abs in and keep your back flat.", "Using your arms, lift and row your body towards the bar.", "Pause for a moment and with slow controlled movements lower your self back to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "back", "core", "neck" ],
  "equipment" : [ "bar" ],
  "images" : [ "\"body-row-medium-1.png\"", "\"body-row-medium-2.png\"" ]
}, {
  "title" : "Cuban Dumbbell Press",
  "description" : "This is a three point exercise for shoulder and middle back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp dumbbells in each hand with a pronated grip (palms facing back wards, your shoulder rotated forward.", "Stand upright with your feet shoulder width apart and your knees slightly bent, contract your abdominals.", "Slowly lift your arms up so elbows are bent and parallel with the floor while you squeeze your shoulders together.", "then rotate your arms, bringing the dumbbells forward so that they are now above your shoulder and in line with your elbows.", "In a controlled manner lower your arms and return to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "middle back" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"cuban-dumbbell-press-medium-1.png\"", "\"cuban-dumbbell-press-medium-2.png\"", "\"cuban-dumbbell-press-medium-3.png\"" ]
}, {
  "title" : "Bent Arm Pullover",
  "description" : "This is an exercise for chest, triceps, shoulders and lats strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on a bench with your head hanging slightly over the end and your feet flat on the floor.", "Hold a barbell with a close grip (approximately 14”), keep your elbows in throughout the exercise.", "Starting with your arms fully extended over your chest, slowly lower the bar in an arc over your head and towards the floor.", "Pull the bar back up to chest height in a slow controlled manner and return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "lats", "shoulders", "triceps" ],
  "equipment" : [ "barbell", "flat bench" ],
  "images" : [ "\"bent-arm-pullover-medium-1.png\"", "\"bent-arm-pullover-medium-2.png\"" ]
}, {
  "title" : "Barbell Dead Lifts",
  "description" : "The techniques is identical to that of the Smith Machine dead lift except for the fact that this exercise provides less support.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart so that your feet are under the bar.", "Keeping your back straight bend at the waist, allow some bend in your knees.", "Grasp the par with an overhand grip approximately 16 inches apart.", "Straighten your back as you hold the bar at arm’s length.", "Bend over again lowering the bar to just above the floor." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"barbell-dead-lifts-medium-1.png\"", "\"barbell-dead-lifts-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Good Mornings",
  "description" : "This exercise utilises the same technique of the standard Good Mornings yet the use of the Smith Machine provides more stability.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a barbell across your shoulders.", "Keeping your head up and your back completely straight, bend at the waist until your back is parallel with the floor.", "Return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-good-mornings-medium-1.png\"", "\"smith-machine-good-mornings-medium-2.png\"" ]
}, {
  "title" : "Barbell Good Mornings",
  "description" : "This is one of the oldest exercises in bodybuilding but it still is one of the best for working the lower back.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a barbell across your shoulders.", "Keeping your head up and your back completely straight, bend at the waist until your back is parallel with the floor.", "Return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"barbell-good-mornings-medium-1.png\"", "\"barbell-good-mornings-medium-2.png\"" ]
}, {
  "title" : "Seated Cable Rows",
  "description" : "This is an exercise for middle back, biceps and lower back strengthening.",
  "types" : [ "compound" ],
  "steps" : [ "Sit at a low pulley machine with your feet resting against the footrests and your knees slightly bent.", "With your abs drawn in and your back straight lean forward slightly to grasp the pulleys with an overhand grip (palms face downwards).", "Slowly bring the pulleys back towards your abs while sitting upright, keep your elbows in close to your chest.", "Pause for a moment then return slowly return the pulleys to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "middle back" ],
  "secondaryMuscleGroup" : [ "biceps", "lower back" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"seated-cable-rows-medium-1.png\"", "\"seated-cable-rows-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Incline Bench Press",
  "description" : "This is an advanced exercise for building and sculpting the chest as well as your triceps and shoulders.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on an incline bench which has been set to an incline of 45 degrees.", "Start with the dumbbells at shoulder height, your arms wide and elbows pointing down to the floor.", "Grasp the dumbbells with a grip so your palms face each other.", "Raise your arms up over your chest bringing the dumbbells closer together as they meet over your chest, as if you were clapping.", "Slowly return the dumbbells to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "dumbbells", "incline bench" ],
  "images" : [ "\"dumbbell-incline-bench-press-medium-1.png\"", "\"dumbbell-incline-bench-press-medium-2.png\"" ]
}, {
  "title" : "Lateral Dumbbell Raises",
  "description" : "This is an exercise for lateral deltoid, shoulder and forearm strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand, palms facing inward towards your body and the dumbbells at your sides.", "Standing with your feet shoulder with apart, draw your abs in and bend your knees slightly.", "While keeping your torso still, raise the your arms up to the sides keeping your arms straight with a slight bend in the elbows.", "Raise your arms up until in line with your shoulders, your palms should face the floor.", "Hold the position for a moment then in a controlled movement lower your arms to the starting position.", "Repeat" ],
  "primaryMusclGroup" : [ "lateral deltoid" ],
  "secondaryMuscleGroup" : [ "forearm", "shoulders" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"lateral-dumbbell-raises-medium-1.png\"", "\"lateral-dumbbell-raises-medium-2.png\"" ]
}, {
  "title" : "Incline Chest Press",
  "description" : "This exercise is for strengthening the upper chest and is preferred among beginners as it provides support and control.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the machine so that the handles are near the upper portion of your chest.", "Slowly press the handles forward until your hands are fully extended, do not lock your elbows.", "Pause for a moment and then with a controlled movement lower your hands back to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "chest machine" ],
  "images" : [ "\"incline-chest-press-medium-1.png\"", "\"incline-chest-press-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Bench Press",
  "description" : "With the use of a Smith Machine this exercise strengthens your chest shoulders and triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a flat bench in the middle of the Smith Machine, with the bar in line with the middle of your chest.", "Lying on the bench, grasp the bar at shoulder width apart.", "Unlatch the bar and slowly lower the bar to your chest.", "Extend your arms fully and raise the bar to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "flat bench", "smith machine" ],
  "images" : [ "\"smith-machine-bench-press-medium-1.png\"", "\"smith-machine-bench-press-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Squats",
  "description" : "This exercise uses the Smith Machine to work the Quadriceps, Hamstrings, Calves and Glutes. A great overall exercise for the lower body. There are many variations on the squat, this is the original version using a Smith Machine for better flow of movement.",
  "types" : [ "compound" ],
  "steps" : [ "Set the height of the barbell to shoulder height.", "Place your feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift over your toes (this will cause you to loose balance).", "Pause in the downward squatting position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "hamstrings" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-squats-medium-1.png\"", "\"smith-machine-squats-medium-2.png\"" ]
}, {
  "title" : "Push Ups with feet on exercise ball",
  "description" : "This is similar to the standard Push Up except using an Exercise Ball forces you to engage the muscle of your core (Rectus Abdominis, Transverse Abdominis, and the Obliques).",
  "types" : [ "isolation" ],
  "steps" : [ "Place your feet and shins flat on an Exercise Ball.", "Place your arms in front of you at shoulder width apart, place your hands under your arms and press up from the ground until your arms are fully extended.", "Pause at the top for a moment and steady your balance.", "Slowly return to the starting position with your chest lowered towards the ground." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "body", "exercise ball" ],
  "images" : [ "\"push-ups-with-feet-on-exercise-ball-medium-1.png\"", "\"push-ups-with-feet-on-exercise-ball-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Incline Bench Press",
  "description" : "This is an exercise for chest, shoulder and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place an incline bench at a 45 degree angle in the middle of the Smith Machine.", "Align the bench so the bar is across the upper portion of your chest.", "Grasp the bar with a shoulder width grip.", "Unlock the bar and slowly lower the weight to your chest, do not bounce the bar on your chest.", "With slow controlled movements, raise the bar back to the starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "incline bench", "smith machine" ],
  "images" : [ "\"smith-machine-incline-bench-press-medium-1.png\"", "\"smith-machine-incline-bench-press-medium-2.png\"" ]
}, {
  "title" : "Push Ups with Feet Elevated",
  "description" : "This is the same general movement as with a Push Up except your feet are elevated allowing greater range of motions and targeting the pectorals differently than the regular Push Up.",
  "types" : [ "isolation" ],
  "steps" : [ "Place your feet on a bench at least 18” off the ground.", "Make sure the tops of your feet are flush against the bench.", "Place your hands on the floor slightly wider than shoulder width apart.", "With your hands directly under your shoulders, press up from the floor, keeping your back and neck in a straight line so you are looking forward during the entire exercise.", "Once your arms are fully extended pause and then with slow controlled movements lower yourself to the floor again." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "bench", "body" ],
  "images" : [ "\"push-ups-with-feet-elevated-medium-1.png\"", "\"push-ups-with-feet-elevated-medium-2.png\"" ]
}, {
  "title" : "Front Dumbbell Raise",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with a dumbbell in each hand with an overhand grip, your feet shoulder width apart and your abs drawn in.", "Keeping each arm straight raise your left arm to just above shoulder height.", "Pause for a moment then in a controlled motion lower the weight to starting position and repeat with your right arm." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"front-dumbbell-raise-medium-1.png\"", "\"front-dumbbell-raise-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Dead Lifts",
  "description" : "This is the same as a Dead Lift but the Smith Machine allows for better control of the weight.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart so that your feet are under the bar.", "Keeping your back straight bend at the waist, allow some bend in your knees.", "Grasp the par with an overhand grip approximately 16 inches apart.", "Straighten your back as you hold the bar at arm’s length.", "Bend over again lowering the bar to just above the floor." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-dead-lifts-medium-1.png\"", "\"smith-machine-dead-lifts-medium-2.png\"" ]
}, {
  "title" : "Seated Rear Lateral Cable Raise",
  "description" : "Tis is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the edge of a bench with your feet on the floor in front of you.", "Rest your chest on your thighs with your back straight, grasp the cable pulleys with opposite hands.", "Raise your upper arms to shoulder height. Pause at the top for a moment.", "Lower your arms to the starting position in a controlled motion.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"seated-rear-lateral-cable-raise-medium-1.png\"", "\"seated-rear-lateral-cable-raise-medium-2.png\"" ]
}, {
  "title" : "V Bar Pull Down",
  "description" : "This is an exercise for lats, biceps and middle back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a V bar to the pull down pulley of a cable machine.", "Sitting upright with your abs drawn grasp the bar with an overhand grip, your palms facing in.", "Pull the bar straight down to your upper chest.", "Pause for a moment after touching the chest and then slowly return the bar to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps", "middle back" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"v-bar-pull-down-medium-1.png\"", "\"v-bar-pull-down-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Raise",
  "description" : "This is an exercise for shoulder and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand upright with your feet shoulder width apart and a slight bend in your knees.", "Grasp a dumbbell in each hand, in front of your thighs. This is your starting position.", "Draw your abs in.", "Raise the dumbbells up on either side of your ribs in a rowing motion by bending your elbows moving them outwards.", "Lower to starting position and repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"dumbbell-raise-medium-1.png\"", "\"dumbbell-raise-medium-2.png\"" ]
}, {
  "title" : "Push Ups Close and Wide Hand Versions",
  "description" : "These are variations on Push Ups, one of the best exercise for muscles of the chest (pectorals), arms (bicep and triceps) and core development. The core muscles are the rectus abdomen and oblique’s which support the spine.",
  "types" : [ "isolation" ],
  "steps" : [ "For a Close Grip Push Up lay face down on the floor, or a mat, with your feet together curled slightly so you rise on the ball of your feet.", "Place you hands close together so your thumbs and index fingers form a triangle on the floor.", "Draw your abs in and inhale as you raise your body up till your arms are straight.", "Keep your head and neck level with your body (don’t look up or down) and don’t allow your back to rise or fall.", "Exhale out as you lower your body back to the ground.", "For a Wide Grip Push Up move your hands out to a position slightly wider than your shoulders.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "core", "shoulders", "triceps" ],
  "equipment" : [ "body" ],
  "images" : [ "\"push-ups-close-and-wide-hand-versions-medium-1.png\"", "\"push-ups-close-and-wide-hand-versions-medium-2.png\"" ]
}, {
  "title" : "Wide Grip Lat Pull Down",
  "description" : "This is an exercise for lats, biceps and middle back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit at a cable pull down machine fitted with a wide bar.", "Grasp the bar with a wide overhand grip (palms facing forward) .", "With your abs drawn in and back straight pull the bar down to your upper chest.", "Pause for a moment and then return the bar to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps", "middle back" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"wide-grip-lat-pull-down-medium-1.png\"", "\"wide-grip-lat-pull-down-medium-2.png\"" ]
}, {
  "title" : "Barbell Neck Press",
  "description" : "This is an advanced exercise for chest strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with you feet planted firmly on the floor.", "Grasp the bar a little wider than shoulder width apart.", "Raise the barbell above your body and move it to the top of your chest, near your neck.", "This is your starting position.", "Lower the bar down so it just touches the top of your chest.", "Raise the bar till your arms are fully extended and your elbows are locked.", "Return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "barbell", "flat bench" ],
  "images" : [ "\"barbell-neck-press-medium-1.png\"", "\"barbell-neck-press-medium-2.png\"" ]
}, {
  "title" : "Decline Barbell Bench Press",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a decline bench with your head lower than your feet.", "Grasp the bar at a grip 3-6 inches wider than your shoulders.", "Raise the bar above your chest, keeping your elbows close in.", "Slowly and with control lower the bar straight to your lower chest.", "Raise the bar back up to starting position with the bar just above your chest.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "barbell", "decline bench" ],
  "images" : [ "\"decline-barbell-bench-press-medium-1.png\"", "\"decline-barbell-bench-press-medium-2.png\"" ]
}, {
  "title" : "Body Leg Lifts",
  "description" : "This is an exercise for gluts and hamstring strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Using a post or tall weight bench for balance stand straight with your abs drawn in.", "Raise one off the ground and behind you while standing on the other leg.", "Slowly lower the leg and raise it again while flexing the gluts.", "Repeat with your other leg." ],
  "primaryMusclGroup" : [ "gluts" ],
  "secondaryMuscleGroup" : [ "hamstring" ],
  "equipment" : [ "body" ],
  "images" : [ "\"body-leg-lifts-medium-1.png\"", "\"body-leg-lifts-medium-2.png\"" ]
}, {
  "title" : "Incline Dumbbell Fly’s",
  "description" : "This is an exercise for chest sculpting and strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on an incline bench set a 45 degree angle with a dumbbell in each hand and your feet firmly on the ground.", "Lift the dumbbells over your chest extending your arms fully and your palms facing each other.", "Keeping a slight bend in your elbows, lower the dumbbells towards the floor in and arc like motion.", "Slowly return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "dumbbells", "incline bench" ],
  "images" : [ "\"incline-dumbbell-flys-medium-1.png\"", "\"incline-dumbbell-flys-medium-2.png\"" ]
}, {
  "title" : "Back Extension on Stability Ball",
  "description" : "This exercise provides flexibility as it strengthens the muscles of the back and core.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie prone (on your stomach) on a Stability Ball with your toes firmly planted on the floor for balance.", "With your hands across your chest or at your ears, raise your chest off the ball so you are hyperextending your spine.", "Slowly return your chest to the ball.", "Repeat." ],
  "primaryMusclGroup" : [ "lower back" ],
  "secondaryMuscleGroup" : [ "core", "hamstrings" ],
  "equipment" : [ "exercise ball" ],
  "images" : [ "\"back-extension-on-stability-ball-medium-1.png\"", "\"back-extension-on-stability-ball-medium-2.png\"" ]
}, {
  "title" : "Upright Cable Row",
  "description" : "This is an exercise for shoulder, biceps and upper back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a straight bar to the pulley on the floor.", "Stand with your feet shoulder width apart, your abs drawn in and your back straight.", "Grasp the bar with an overhand grasp (your palms facing downwards) and pull it up towards your waist, this is the starting position.", "Raise the bar up to in line with your shoulders.", "Pause at the top and rotate your shoulder blades together.", "Lower the bar in a controlled motion to the starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps", "upper back" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"upright-cable-row-medium-1.png\"", "\"upright-cable-row-medium-2.png\"" ]
}, {
  "title" : "Straight Arm Dumbbell Pullover",
  "description" : "This is an exercise for chest and shoulder strengthening which mainly targets the rotator cuff muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with your feet flat on the floor and your head at the end of the bench.", "Grasp a dumbbell and raise it over your chest.", "Keeping your elbows as straight as possible, lower the weight in an arc over your head and as low to the ground as possible with out any pain.", "Return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "lats", "shoulders", "triceps" ],
  "equipment" : [ "dumbbell", "flat bench" ],
  "images" : [ "\"straight-arm-dumbbell-pullover-medium-1.png\"", "\"straight-arm-dumbbell-pullover-medium-2.png\"" ]
}, {
  "title" : "Rear Deltoid Row Dumbbell",
  "description" : "This is an exercise for deltoid, biceps and trapezius strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place your right foot on the floor, rest your left knee and hand on a flat bench.", "Lean forward so your body’s weight is supported by your left arm and knee.", "Keeping your back flat, reach down and pick up the dumbbell with your right hand.", "Raise your right arm as close to your chest as possible; while bending and bringing your elbow back as far as you can.", "Pause at the top for a moment and then lower the dumbbell in a controlled manner to the starting position.", "Switch arms by doing the opposite positioning.", "Repeat." ],
  "primaryMusclGroup" : [ "posterior deltoid" ],
  "secondaryMuscleGroup" : [ "biceps", "lateral deltoid", "trapezius" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"rear-deltoid-row-dumbbell-medium-1.png\"", "\"rear-deltoid-row-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Stationary Abdominal Draw In",
  "description" : "This is an exercise for abdominal and core strengthening which are vital in supporting the spine.",
  "types" : [ "isometric" ],
  "steps" : [ "Get down on a mat on your hands and knees, forming a four point rectangle or square shape.", "Keep your back straight and your hips and pelvis in a neutral position.", "Draw your abs in, crunching your abs while keeping your back still.", "Hold for a moment and then release returning to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ "core" ],
  "equipment" : [ "body" ],
  "images" : [ "\"stationary-abdominal-draw-in-medium-1.png\"", "\"stationary-abdominal-draw-in-medium-2.png\"" ]
}, {
  "title" : "Hammer Grip Incline Bench Press",
  "description" : "This is an advanced exercise for strengthening the chest, triceps and shoulders.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand and lay on an incline bench set at a 45 degree angle.", "Keep your feet flat on the floor and your back against the bench at all times.", "Using a hammer grip (with your palms facing each other), lift the weights to shoulder height on either side of your chest.", "Extend your arms fully and press the dumbbells up.", "Slowly return the dumbbells to the starting position at the sides of your chest." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "dumbbells", "incline bench" ],
  "images" : [ "\"hammer-grip-incline-bench-press-medium-1.png\"", "\"hammer-grip-incline-bench-press-medium-2.png\"" ]
}, {
  "title" : "Straight Arm Push Down",
  "description" : "This exercise for strengthening the Lats and also works the Triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp wide grip pull down bar with a wide grip so your hands are on the portion of the bar which curves down.", "Stand erect with your abs drawn in.", "Keeping a slight bend in your elbows and your wrist steady pull the bar down from the starting position to your upper thighs.", "With a controlled motion bring the bar back up to starting position." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"straight-arm-push-down-medium-1.png\"", "\"straight-arm-push-down-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Rear Deltoid Row",
  "description" : "This is an exercise for rear deltoid,shoulder, biceps and back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ " Set the bar to the lowest setting.", "Place your feet shoulder width apart with a slight bend in the knees.", "Bend at the waist while keeping your back straight and chest parallel to the floor.", "Grasp the bar slightly wider than your shoulders with an overhand grasp and your arms straight with a slight bend in the elbows.", "Raise the bar with a controlled motion to the lower part of your chest by bending and elevating your elbows.", "Hold for a moment and then lower to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "rear deltoid" ],
  "secondaryMuscleGroup" : [ "back", "biceps", "shoulders" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-rear-deltoid-row-medium-1.png\"", "\"smith-machine-rear-deltoid-row-medium-2.png\"" ]
}, {
  "title" : "One Arm Bench Press",
  "description" : "This is an advanced strengthening exercise for the chest and rotator cuff muscles of the shoulder.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on a bench with your feet placed firmly on the floor and your abs drawn in.", "Grasp the dumbbell in one hand and bring it up to the side of your chest, this is starting position.", "Extend your arm, pressing the dumbbell up till your arm is straight and your elbow locked.", "Using slow controlled movements, lower the weight to starting position.", "Switch arms after completing reps with one arm.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "dumbbell", "flat bench" ],
  "images" : [ "\"one-arm-bench-press-medium-1.png\"", "\"one-arm-bench-press-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Upright Row",
  "description" : "This is an exercise for shoulder and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart and your abs drawn in.", "Place the bar on the Smith Machine in the position where your arms are fully extended in front of you.", "Place your hands shoulder width apart and raise the bar up towards your chin with a controlled motion.", "Pause at the top for a moment and rotate your shoulder blades together.", "Lower the bar to the starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps", "upper back" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-upright-row-medium-1.png\"", "\"smith-machine-upright-row-medium-2.png\"" ]
}, {
  "title" : "Incline Cable Fly’s",
  "description" : "This exercise is an alternative to the Butterfly or Pec Deck, it defines the muscles of the chest.Place an incline bench set at a 45 degree angle between two cable towers.",
  "types" : [ "isolation" ],
  "steps" : [ "Place an incline bench set at a 45 degree angle between two cable towers.", "Grasp a pulley in each hand with your palms facing up.", "With a slight bend in your elbows, squeeze your chest and pull the cables in an arc so they meet together in the middle of your chest.", "Hold for a moment and then slowly lower your hands back to starting position at along the same arc." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "biceps", "forearm", "triceps" ],
  "equipment" : [ "cable machine", "incline bench" ],
  "images" : [ "\"incline-cable-flys-medium-1.png\"", "\"incline-cable-flys-medium-2.png\"" ]
}, {
  "title" : "One Arm Dumbbell Shoulder Press",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, back straight and abs drawn in.", "Grasp a dumbbell in your hand and lift it with a bent elbow to your shoulder height to start.", "Lift the dumbbell straight up till your arm is fully extended overhead.", "Lower in a controlled manner and return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps", "triceps" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"one-arm-dumbbell-shoulder-press-medium-1.png\"", "\"one-arm-dumbbell-shoulder-press-medium-2.png\"" ]
}, {
  "title" : "Static Neck Flexion and Extension",
  "description" : "An exercise to either build or warm-up front and back neck muscles.",
  "types" : [ "isometeric" ],
  "steps" : [ "Stand or sit with your head in neutral position.", "Place both of your hands on your forehead.", "Press your head against your hands and contract your neck muscles.", "Keep your head from moving forward. Hold for at least 30 seconds.", "Repeat with hands on the back of your head, pressing against them." ],
  "primaryMusclGroup" : [ "neck extensors", "neck flexors" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"static-neck-flexion-and-extension-medium-1.png\"", "\"static-neck-flexion-and-extension-medium-2.png\"" ]
}, {
  "title" : "Decline Dumbbell Bench Press",
  "description" : "This is an exercise for chest, shoulder and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp the dumbbells your hands and lie on a decline bench with your head lower than your feet.", "Raise the dumbbells above your chest, bringing your elbows close in, this is your starting position.", "Slowly and with control lower the dumbbells to either side of your lower chest.", "Raise the dumbbells back up to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "decline bench", "dumbbells" ],
  "images" : [ "\"decline-dumbbell-bench-press-medium-1.png\"", "\"decline-dumbbell-bench-press-medium-2.png\"" ]
}, {
  "title" : "Static Neck Side Flexion",
  "description" : "An exercise either build or warm up neck side flexors.",
  "types" : [ "isometric" ],
  "steps" : [ "Stand or sit with your head in neutral position.", "Place your left hand against the left side of your head, above your ear.", "Push your head against your hand, without moving your head.", "Repeat with your right hand, right side of your head." ],
  "primaryMusclGroup" : [ "neck side flexors" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"static-neck-side-flexion-medium-1.png\"", "\"static-neck-side-flexion-medium-2.png\"" ]
}, {
  "title" : "Decline Chest Press",
  "description" : "This is an exercise for the strengthening of the lower chest or pectoral muscles and is preferred by beginners as it provides support and stability.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the machine so that the handles are near the lower portion of your chest.", "Slowly press the handles forward until your hands are fully extended, do not lock your elbows.", "Pause for a moment and then with a controlled movement lower your hands back to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "chest machine" ],
  "images" : [ "\"decline-chest-press-medium-1.png\"", "\"decline-chest-press-medium-2.png\"" ]
}, {
  "title" : "Reverse Grips Bent Over Barbell Rows",
  "description" : "This is an exercise for middle back and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Bend over a barbell at slight angle with your knees bent and your back straight.", "Grasp the bar with a reverse grip (palms facing up) and slowly pull the barbell to your abs, keeping your elbows close to your sides.", "Pause for a moment at the top.", "Return the barbell to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "middle back" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"reverse-grips-bent-over-barbell-rows-medium-1.png\"", "\"reverse-grips-bent-over-barbell-rows-medium-2.png\"" ]
}, {
  "title" : "Incline Bench Press with Bands",
  "description" : "This is an exercise for chest and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Securely fasten the band under the leg of a flat bench, near your head.", "Lie flat on the bench with your feet flat on the floor in order to stabilise your movements.", "Grasp one end of the band in each hand and starting with your hands at chest level.", "Press upwards so your arms are fully extended.", "With a slow controlled motion return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "exercise band", "incline bench" ],
  "images" : [ "\"incline-bench-press-with-bands-medium-1.png\"", "\"incline-bench-press-with-bands-medium-2.png\"" ]
}, {
  "title" : "Decline Dumbbell Fly’s",
  "description" : "This is an exercise for chest and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a decline bench with your head lower than your body and your feet firmly on the ground.", "With dumbbells together above your shoulders and your arms straight out above you as your starting position.", "Keeping your arms straight and with a slight bend in your elbows lower the dumbbells down towards the floor in an arc, up until just above your shoulders.", "Return to the starting position in a slow controlled manner.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "decline bench", "dumbbells" ],
  "images" : [ "\"decline-dumbbell-flys-medium-1.png\"", "\"decline-dumbbell-flys-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Upright Rows",
  "description" : "This is an exercise for shoulder, biceps and upper back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand with an overhand grip (palms facing downwards) and hold them in front of your thighs.", "Stand with your feet shoulder width apart, your abs drawn in and your back straight.", "Starting with the dumbbells at your thighs, slowly raise them up towards your shoulders by bending your elbows.", "Pause at the top and rotate your shoulder blades together.", "Lower the dumbbells in a controlled motion to your thighs.", "Repeat" ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps", "upper back" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"dumbbell-upright-rows-medium-1.png\"", "\"dumbbell-upright-rows-medium-2.png\"" ]
}, {
  "title" : "Tate Press",
  "description" : "This is an advanced triceps exercise which moves the muscle differently than other exercises.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay flat on a bench with your head at one end and your feet firmly planted on the floor.", "Hold a dumbbell in each hand so your palms are faced towards your feet.", "Drawing your abs in and keeping your back on the bench, raise the weights to the center of your chest.", "Without moving elbows, slowly raise your arms up and out contracting your triceps." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"tate-press-medium-1.png\"", "\"tate-press-medium-2.png\"" ]
}, {
  "title" : "Wide Grip Chin Up",
  "description" : "This variation on the basic chin up is a great exercise for people who rock climb.",
  "types" : [ ],
  "steps" : [ "Grasp a chin up bar with a slightly wider than shoulder width grip.", "Keeping your body straight pull yourself up and to one side of the bar.", "Lower your body back down to the starting position.", "Raise yourself to the other side of the bar.", "Repeat." ],
  "primaryMusclGroup" : [ "back" ],
  "secondaryMuscleGroup" : [ "biceps", "neck" ],
  "equipment" : [ ],
  "images" : [ "\"wide-grip-chin-up-medium-1.png\"", "\"wide-grip-chin-up-medium-2.png\"" ]
}, {
  "title" : "Narrow Parallel Grip Chin-ups",
  "description" : "This is an exercise similar to the regular Chin Up but focuses more on shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp the bar with an supinated (overhand) grip so that your palms are facing.", "Let your body hang from the bar with your arms straight.", "Slowly pull yourself up so that your chin is higher than the bar.", "With a controlled movement lower yourself to the starting position.", "Repeat" ],
  "primaryMusclGroup" : [ "lats", "shoulders" ],
  "secondaryMuscleGroup" : [ "back", "core" ],
  "equipment" : [ "bar", "body" ],
  "images" : [ "\"narrow-parallel-grip-chin-ups-medium-1.png\"", "\"narrow-parallel-grip-chin-ups-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Bent Arm Pullover",
  "description" : "This is an exercise for chest, shoulder, lats and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on a bench with your head hanging slightly over the end and your feet flat on the floor.", "Hold a dumbbell with both hands, keep your elbows in throughout the exercise.", "Starting with your arms fully extended over your chest, slowly lower the dumbbell in an arc over your head and towards the floor.", "Pull the dumbbell back up to chest height in a slow controlled manner and return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "lats", "shoulders", "triceps" ],
  "equipment" : [ "dumbbell", "flat bench" ],
  "images" : [ "\"dumbbell-bent-arm-pullover-medium-1.png\"", "\"dumbbell-bent-arm-pullover-medium-2.png\"" ]
}, {
  "title" : "Gironda Sternum Chins",
  "description" : "This is an exercise for lats, biceps and middle back strengthening; which is similar t the basic chin up but focusses more on lats.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp the pull up bar with a shoulder width underhand grip.", "Hang from the bar with your arms fully extended.", "Pulling yourself towards the bar lean your head back as far as you can and arch your spine.", "Continuing pulling so that your collarbone passes the bar and you are able to touch your sternum to the bar.", "Slowly lower yourself back to starting position.", "Repeat this motion." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps", "middle back" ],
  "equipment" : [ "bar", "body" ],
  "images" : [ "\"gironda-sternum-chins-medium-1.png\"", "\"gironda-sternum-chins-medium-2.png\"" ]
}, {
  "title" : "Hack Squat with barbell",
  "description" : "This is another variation of the basic Squat that focuses primarily on the quadriceps or thigh muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Place the barbell on the floor just behind your legs and stand with your feet shoulder width apart with your toes pointing forward.", "With your feet firmly placed on the floor, reach down and grasp the barbell from behind with an overhand grip.", "Lift the barbell by extending your hips and knees, taking care not to lock your knees.", "Lower yourself (squat) down until your thighs are parallel to the floor.", "Slowly raise yourself up to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"hack-squat-with-barbell-medium-1.png\"", "\"hack-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Rear Deltoid Row Barbell",
  "description" : "This is an exercise for shoulder and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a barbell on the floor in front of you with the resided weights attached.", "With your knees bent and back straight grasp the bar with a wide overhand grip (palms facing downwards).", "Keep your chest steady and your arms perpendicular to your chest.", "Pull the bar as far up to your chest as you can.", "Hold for a moment than lower the bar in a controlled manner.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"rear-deltoid-row-barbell-medium-1.png\"", "\"rear-deltoid-row-barbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Barbell Floor Press",
  "description" : "This is an exercise for chest and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on your back with your knees bent and your feet firmly on the floor.", "Draw in your abs and contract your lats, and glutes.", "Have your partner hand you the bar and with your bicep parallel to the floor lift and extend your arm fully so it is straight.", "Return to the starting position.", "Complete reps and switch arms." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"one-arm-barbell-floor-press-medium-1.png\"", "\"one-arm-barbell-floor-press-medium-2.png\"" ]
}, {
  "title" : "Cable Shoulder Shrugs",
  "description" : "An exercise for trapezius strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a pulley to the lowest setting on cable machine.", "Stand with your feet shoulder width apart, your abs drawn and your back straight.", "Start with the pulley at waist height.", "Grasp the pulley and shrug your shoulders up while keeping your arms extended.", "Hold this position for a moment then with a controlled motion return to the starting position of the pulley to waist height." ],
  "primaryMusclGroup" : [ "trapezius" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"cable-shoulder-shrugs-medium-1.png\"", "\"cable-shoulder-shrugs-medium-2.png\"" ]
}, {
  "title" : "Lying Rear Lateral Raise",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place the dumbbells at he head of the bench.", "Lie facedown on a raised bench; raised enough for your arms to move freely beneath the bench.", "Place your toes on the floor in order to stabilise yourself.", "Grasp the dumbbells and with a 30 degree bend in your elbows, this is the starting position.", "Raise your arms to shoulder height, maintaining a controlled motion.", "Return to starting position and repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbells", "flat bench" ],
  "images" : [ "\"lying-rear-lateral-raise-medium-1.png\"", "\"lying-rear-lateral-raise-medium-2.png\"" ]
}, {
  "title" : "Bent-over Lateral Cable Raises",
  "description" : "This is an exercise for shoulder, trapezius and middle back strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp the handle of the low pulley with your right hand.", "Bend forward from the waist; your upper body should be nearly parallel with the floor. Bend your knees slightly and place your left hand on your left thigh. Let your right arm hang from your shoulder in front of you with your elbow slightly bent. This is your starting position.", "Lift your right arm, keeping your elbow slightly bent.", "Keep moving your arm until it is parallel to the floor, in line with your right ear.", "Slowly bring the weight back down to the starting position.", "Perform exercise on left arm and then repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "middle back", "trapezius" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"bent-over-lateral-cable-raises-medium-1.png\"", "\"bent-over-lateral-cable-raises-medium-2.png\"" ]
}, {
  "title" : "Crossover with Bands",
  "description" : "This is an exercise for chest, biceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Secure an exercise to a post (or secure pole) and hold it in each hand.", "Step forward so the band has some tension, facing away from the post.", " Your arms at mid chest height and out to the side, palms facing forward this is your starting position.", "Bring your hands together in front of you.", "Hold this for a moment and then in a controlled motion return to starting position." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "biceps", "shoulders" ],
  "equipment" : [ "exercise band" ],
  "images" : [ "\"crossover-with-bands-medium-1.png\"", "\"crossover-with-bands-medium-2.png\"" ]
}, {
  "title" : "One Legged Cable Kickback",
  "description" : "This is an exercise for gluts and hamstring strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Standing at a cable tower attach an ankle cuff to a low pulley.", "Facing the weight stack, with a slight bend in your knees and your abs drawn in", "Slowly kick your ankle back in and arc as high as you are able to.", "Return to starting position and switch ankles." ],
  "primaryMusclGroup" : [ "gluts" ],
  "secondaryMuscleGroup" : [ "hamstring" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"one-legged-cable-kickback-medium-1.png\"", "\"one-legged-cable-kickback-medium-2.png\"" ]
}, {
  "title" : "Wide Grip Decline Barbell Pullover",
  "description" : "This is an advanced strengthening exercise which targets the pectoral or chest muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a decline bench with your feet higher than your head and your feet firmly on the ground.", "Grasp the barbell with an extra wide grip (your hands near the plates) and starting at you’re your upper thighs raise the barbell in an arc over your head towards the floor.", "Slowly return the barbell to starting position on your thighs.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "barbell", "decline bench" ],
  "images" : [ "\"wide-grip-decline-barbell-pullover-medium-1.png\"", "\"wide-grip-decline-barbell-pullover-medium-2.png\"" ]
}, {
  "title" : "Incline Fly’s with a Twist",
  "description" : "This is an exercise for chest sculpting and strengthening which is very similar to the incline fly’s.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on an incline bench set at a 45 degree angle with a dumbbell in each hand and your feet flat on the ground.", "Start with the dumbbells out to the sides of your chest, parallel to the floor as you would a regular Fly.", "Raise the dumbbells over your chest in and arc, at the top turn your pinky finger in so they are facing each other.", "Slowly return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "dumbbells", "incline bench" ],
  "images" : [ ]
}, {
  "title" : "Bosu Ball Push Up",
  "description" : "This is an exercise for chest, core, shoulders and triceps strengthening with the use of a Bosu ball.",
  "types" : [ "isolation" ],
  "steps" : [ "Place the Bosu ball flat side down on the floor.", "Kneel on the floor with your arms fully extended on the ball, and body straight.", "Keeping your abs drawn in and your body straight, by bending your elbows lower your chest to the ball.", "Pause for a moment and then return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "core", "shoulders", "triceps" ],
  "equipment" : [ "bosu ball" ],
  "images" : [ "\"bosu-ball-push-up-medium-1.png\"", "\"bosu-ball-push-up-medium-2.png\"" ]
}, {
  "title" : "Barbell Front Raise and Pullover",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench and grasp a barbell using a medium grip (about 15” apart).", "Place the barbell on your upper thighs and lock your arms straight with a slight bend in your elbows.", "Draw your abs in and keeping your back flat on the bench, raise your arms up in an arc over and behind your head (as if you were performing a reverse pullover).", "Slowly return the barbell to the starting position on your thighs." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "barbell", "flat bench" ],
  "images" : [ "\"barbell-front-raise-and-pullover-medium-1.png\"", "\"barbell-front-raise-and-pullover-medium-2.png\"" ]
}, {
  "title" : "One Armed Biased Push Up",
  "description" : "This is an exercise for chest strengthening but also strengthens ones core, shoulders, biceps and triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Arrange the ball so that as you begin the exercise, one hand on the Bosu ball and the other on the floor.", "Place the ball flat side down on the floor.", "Kneel on the floor with your arms fully extended on the dome, and body straight.", "Keeping your abs drawn in and your body straight, lower your chest to the ball.", "Pause for a moment and then return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "bicpes", "core", "shoulders", "triceps" ],
  "equipment" : [ "bosu ball" ],
  "images" : [ "\"one-armed-biased-push-up-medium-1.png\"", "\"one-armed-biased-push-up-medium-2.png\"" ]
}, {
  "title" : "Underhand Pull downs",
  "description" : "This is an exercise for lats and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sitting upright with your abs drawn in grasp a Pull Down bar with and underhand grip shoulder width apart.", "Pull the bar down till the bar reaches your upper chest, keeping your elbows close to your body.", "Slowly return the bar to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"underhand-pull-downs-medium-1.png\"", "\"underhand-pull-downs-medium-2.png\"" ]
}, {
  "title" : "Butterfly Machine",
  "description" : "This is an exercise for chest strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the machine so you are sitting at chest heights with the pads.", "Sit on the machine with your back flat.", "Place your forearms on the pads, parallel to the floor, this is starting position.", "Using your forearms, push the pads together slowly as you squeeze your chest.", "Return your arms to the stretched out starting position in a controlled motion.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "butterfly machine" ],
  "images" : [ "\"butterfly-machine-medium-1.png\"", "\"butterfly-machine-medium-2.png\"" ]
}, {
  "title" : "Underhand Pull down",
  "description" : "This is an exercise for lats and biceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Sitting upright with your abs drawn in grasp a Pull Down bar with and underhand grip shoulder width apart.", "Pull the bar down till the bar reaches your upper chest, keeping your elbows close to your body.", "Slowly return the bar to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"underhand-pull-down-medium-1.png\"", "\"underhand-pull-down-medium-2.png\"" ]
}, {
  "title" : "Lying One Arm Rear Lateral Raise",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay face down on a flat bench high enough for your arms to hang down to the floor.", "Place a dumbbell at your side.", "Your other hand not grasping the dumbbell can be on the floor stabilising your movements.", "Grasp the dumbbell in your hand and raise your upper arm to shoulder height.", "Keep your arm straight and perpendicular to your chest with a slight bend in the elbow.", "In a slow controlled manner lower your arm to starting position." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell", "flat bench" ],
  "images" : [ "\"lying-one-arm-rear-lateral-raise-medium-1.png\"", "\"lying-one-arm-rear-lateral-raise-medium-2.png\"" ]
}, {
  "title" : "Pullover On Stability Ball With Weight",
  "description" : "This is an exercise for back, shoulders and neck strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a Barbell or Dumbbell and sit on a Ball with your feet firmly placed on the floor.", "Lower your body so your upper abs are the only part of your body supported on the Ball.", "Bring the Barbell or Dumbbell to your chest with your arms extend.", "In an arcing motion raise the Barbell or Dumbbell over and behind your head towards the floor.", "Return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "back", "neck" ],
  "equipment" : [ "dumbbell", "exercise ball" ],
  "images" : [ "\"pullover-on-stability-ball-with-weight-medium-1.png\"", "\"pullover-on-stability-ball-with-weight-medium-2.png\"" ]
}, {
  "title" : "Wide Grip Bench Press",
  "description" : "This is an exercise for chest, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on a bench with your feet flat on the floor.", "Place your hands wider than shoulder width apart on the bar and lift it off the rack, this is starting position.", "Bring the bar over your chest and lower it till it is just above your body.", "Extend your arms upward and raise the bar straight up.", "Pause for a moment and with slow controlled movement, return the bar to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "barbell", "flat bench" ],
  "images" : [ "\"wide-grip-bench-press-medium-1.png\"", "\"wide-grip-bench-press-medium-2.png\"" ]
}, {
  "title" : "Incline Biceps Curl with Dumbbell",
  "description" : "This exercise uses an incline bench to change your body’s position as you perform bicep curls. The movement is very similar to a Preacher Curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust an incline bench to a 45 degree angle.", "Grasp dumbbells in each hand and sit down with your back against the bench, with your feet resting on the floor for support.", "Allow your arms to hang down at your sides.", "Keeping your elbow straight, raise the dumbbells up towards your head, contracting your biceps.", "In a controlled manner lower the weight and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"incline-biceps-curl-with-dumbbell-medium-1.png\"", "\"incline-biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Incline Inner Biceps Curl with Dumbbell",
  "description" : "This exercise uses an incline bench and twist to more to change your body’s position as you perform bicep curls. The movement is very similar to a Preacher Curl.",
  "types" : [ "isolation" ],
  "steps" : [ " Adjust an incline bench to a 45 degree angle.", "Grasp dumbbells in each hand with and sit down with your back against the bench, with your feet resting on the floor for support.", "Allow your arms to hang down at your sides, your palms facing your body.", "Keeping your elbow straight, raise the dumbbells up towards your head, contracting your biceps.", "In a controlled manner lower the weight and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"incline-inner-biceps-curl-with-dumbbell-medium-1.png\"", "\"incline-inner-biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Overhead Curl with Cable",
  "description" : "By using cable this exercise isolates and defines the biceps (arm) muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a stirrup handle to each side of a high pulley on a cable machine.", "Grasp the handles with palms facing up and stand with your feet shoulder width apart.", "Extend your arms fully to each side.", "Keeping your elbows steady, curl your wrists towards the sides of your head.", "Contract your biceps and pause for a moment.", "Then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"overhead-curl-with-cable-medium-1.png\"", "\"overhead-curl-with-cable-medium-2.png\"" ]
}, {
  "title" : "Preacher Curl with Machine",
  "description" : "A Preacher Curl uses a special bench to support the triceps and isolate the biceps to build the arms. This version of the exercises is a machine exercise. This is a good exercise for beginners.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the bench so your arms are level with the top of the bench. Rest your arms against the bench and extend them fully. Grasp the bar underhand (palms facing up) and pull it towards your head. Pause for a moment and then lower the bar back to starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"preacher-curl-with-machine-medium-1.png\"", "\"preacher-curl-with-machine-medium-2.png\"" ]
}, {
  "title" : "Lying Close Grip Biceps Curls with Cable",
  "description" : "This exercise combines a flat body position with a pulling motion to work the biceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a flat bench under a cable weight stack and attach a flat bar to the pulley.", "Lie down with your head towards the stack and your feet firmly on the floor.", "Grasp the bar with your palms down, about 8 inches apart, and extend your arms straight up.", "Curl the bar down in an arc touching your chin.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"lying-close-grip-biceps-curls-with-cable-medium-1.png\"", "\"lying-close-grip-biceps-curls-with-cable-medium-2.png\"" ]
}, {
  "title" : "Lying Supine Biceps Curl with Dumbbell",
  "description" : "This is another biceps exercise where you lay down to isolate the muscles you are working. This is an advanced exercise.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with your head at one end and your feet planted firmly on the floor.", "With a dumbbell in each hand, palms facing in, bring your arms down to your sides, hanging off the bench.", "Slowly raise your arms up until they are level with your chest.", "Curl the dumbbells by twisting your palms, so that your forearms touch your biceps.", "Slowly lower your arms to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"lying-supine-biceps-curl-with-dumbbell-medium-1.png\"", "\"lying-supine-biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Lying Bicep Cable Curl",
  "description" : "By lying down you are able to isolate the muscles of your biceps without standing or sitting.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a short bar to a cable pulley set on the lowest setting.", "Lie down on a mat or the floor with your feet touching the weight stack.", "Grasp the bar with and palms facing up.", "With your arms fully extended and your elbows at your sides, pull the bar in an arc to your chest.", "Pause for a moment contracting your biceps, and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "cable" ],
  "images" : [ "\"lying-bicep-cable-curl-medium-1.png\"", "\"lying-bicep-cable-curl-medium-2.png\"" ]
}, {
  "title" : "Lying High Bench Biceps Curl with Barbell",
  "description" : "With this exercise your lay face down to isolate your biceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay face down on a high bench with your head at one end and your toes pressed against the floor to support you.", "Grasp a barbell with palms facing up, about 12 inches apart.", "Extending your arms to the floor, curl your arms back towards your head in a slight arc, so your biceps touch your forearm.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"lying-high-bench-biceps-curl-with-barbell-medium-1.png\"", "\"lying-high-bench-biceps-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Preacher Curl with Dumbbell",
  "description" : "A Preacher Curl uses a special bench to support the triceps and isolate the biceps to build the arms. This version uses dumbbells and single arm movements for better control.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the bench so your arm is level with the top of the bench.", "Grasp a dumbbell in your hand with palms facing up.", "Rest your arm against the bench and extend it fully down.", "Keeping your arm on the bench at all times, curl the dumbbell up towards your head.", "Pause for a moment and then lower the dumbbell back to starting position.", "Switch arms and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"one-arm-preacher-curl-with-dumbbell-medium-1.png\"", "\"one-arm-preacher-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Preacher Curl with Barbell",
  "description" : "A Preacher Curl uses a special bench to support the triceps and isolate the biceps to build the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the bench so that your arms are level with the top of the bench.", "Grasp the bar with palms facing up, shoulder width apart.", "Picking up the bar, rest your arms against the bench and extend them fully.", "Keeping your arms on the bench at all times, curl the bar up towards your head.", "Pause for a moment and then lower the bar back to starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"preacher-curl-with-barbell-medium-1.png\"", "\"preacher-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Wide Grip Standing Biceps Curl with Barbell",
  "description" : "This is a wide grip version of a biceps curl. The wider grip targets the lateral or outer portion of the muscle.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a barbell with palms up as wide as you comfortably can.", "Extend your arms fully against your thighs.", "Keeping your elbows straight, raise the bar towards your chest until your forearms touch your chest.", "Pause for moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"wide-grip-standing-biceps-curl-with-barbell-medium-1.png\"", "\"wide-grip-standing-biceps-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Two-Arm Preacher Curl with Dumbbell",
  "description" : "A Preacher Curl uses a special bench to support the triceps and isolate the biceps to build the arms. This version of the exercise uses dumbbells.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the bench so your arms are level with the top of the bench.", "Grasp a dumbbell in each hand with palms facing up.", "Picking up the dumbbells, rest your arms against the bench and extend them fully towards the floor.", "Keeping your arms on the bench at all times, curl the weight up towards your head.", "Pause for a moment and then lower the weights back to starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"two-arm-preacher-curl-with-dumbbell-medium-1.png\"", "\"two-arm-preacher-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Standing One Arm Bicep Curl with Cable",
  "description" : "This is a single arm version of a bicep cable curl. Cable machines are great for helping you learn proper form while building muscle.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a stirrup bar to a low cable pulley.", "Stand of the side of the weight stack with your legs shoulder width apart and your knees slightly bent and your abs drawn in.", "Grasp the stirrup in one hand with an palms facing up.", "Lower the stirrup to the top of your thighs.", "Keeping your elbows still, curl the stirrup up towards your chest.", "Slowly lower the stirrup to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "cable" ],
  "images" : [ "\"standing-one-arm-bicep-curl-with-cable-medium-1.png\"", "\"standing-one-arm-bicep-curl-with-cable-medium-2.png\"" ]
}, {
  "title" : "Standing Inner Biceps Curl with Dumbbell",
  "description" : "This exercise works the inner biceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each arm with your palms facing each other, fully extend your arms along your sides.", "Curl your arms up and out, turning your palms up and out as you lift.", "Slowly lower the dumbbells to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"standing-inner-biceps-curl-with-dumbbell-medium-1.png\"", "\"standing-inner-biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Standing One Arm Curl Over Incline Bench with Dumbbell",
  "description" : "This exercise is a great alternative to the Preacher Curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand in front of an incline bench so your arm is resting on the top of the angled portion of the bench.", "Grasp a dumbbell in your hand with palms facing up.", "Rest your arm against the back bench and extend it fully down.", "Keeping your arm on the bench at all times, curl the dumbbell up towards your head.", "Pause for a moment and then lower the dumbbell back to starting position.", "Switch arms and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"standing-one-arm-curl-over-incline-bench-with-dumbbell-medium-1.png\"", "\"standing-one-arm-curl-over-incline-bench-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Spider Curl with Barbell",
  "description" : "This exercise uses the straight side of a Preacher Curl bench to increase the range of motion of the exercise.",
  "types" : [ "isolation" ],
  "steps" : [ "Turn a Preacher Curl bench around so you are leaning against the angled side.", "Grasp a barbell with palms up, approximately 6 inches apart.", "Leaning against the bench, lower the bar along the flat side of the bench fully extending your arms.", "Curl your arms up so your biceps are touching your forearms.", "Slowly lower the bar to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"spider-curl-with-barbell-medium-1.png\"", "\"spider-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Seated Inner Biceps Curl with Dumbbell",
  "description" : "This exercise works the inner biceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the edge of a bench with your feet firmly planted on the floor.", "Keep your back straight and your abs drawn in.", "Grasp a dumbbell in each arm with your palms facing each other and fully extend your arms along your sides.", "Curl your arms up and out, turning your palms up and out as you lift.", "Slowly lower the dumbbells to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"seated-inner-biceps-curl-with-dumbbell-medium-1.png\"", "\"seated-inner-biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Seated Bicep Curl with Dumbbell",
  "description" : "This exercise is a seated biceps curl using dumbbells.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on bench with your feet firmly on the floor and your back straight.", "Grasp a dumbbell in each hand with your palms facing each other.", "Lower the dumbbells to your sides and slowly curl your arms up so your palms are facing up.", "Squeeze your biceps at the top and slowly lower to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"seated-bicep-curl-with-dumbbell-medium-1.png\"", "\"seated-bicep-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Seated Close Grip Concentration Curls with Barbell",
  "description" : "Concentration exercises limit your range of movement to increase the effectiveness of the movement. This version uses a barbell.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the end of a flat bench with your feet flat and your legs spread apart.", "Bend forward at your waist keeping your back straight.", "Grasp a barbell in your hands with a close grip approximately 6 inches apart with your palms facing up.", "With your elbow pressed against your inner thigh, curl the bar up towards your chest.", "Slowly lower the bar to the starting position near the floor." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"seated-close-grip-concentration-curls-with-barbell-medium-1.png\"", "\"seated-close-grip-concentration-curls-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Reverse Plate Curls with Weight",
  "description" : "This exercise uses a free weight plate to build muscle.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a plate in your hands with palms facing down, at the 11:00 and 1:00 o’clock position.", "Keeping your elbows and arms at your side, curl the slowly up towards your head.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "weight plate" ],
  "images" : [ "\"reverse-plate-curls-with-weight-medium-1.png\"", "\"reverse-plate-curls-with-weight-medium-2.png\"" ]
}, {
  "title" : "Preacher Hammer Curl with Dumbbell",
  "description" : "This exercise combines a Hammer Curl with a Preacher bench.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the bench so that your arms are level with the top of the bench.", "Grasp a dumbbell in each hand with your palms facing each other, shoulder width apart and extend your arms fully along the bench.", "Keeping your arms and elbows on the bench at all times, curl the dumbbells up towards your head.", "Pause for a moment and then lower the bar back to starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"preacher-hammer-curl-with-dumbbell-medium-1.png\"", "\"preacher-hammer-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Zottman Curl with Dumbbells",
  "description" : "This is an advanced exercise where you turn the dumbbells up and out.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your and your abs drawn in.", "Grasp a dumbbell in each hand with your palms facing each other.", "Start with your hands at your sides.", "Curl your arms up turning your wrists so they are facing down as the dumbbells reach your chest.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"zottman-curl-with-dumbbells-medium-1.png\"", "\"zottman-curl-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "High Cable Curls",
  "description" : "This exercise allows you to target the muscles of your arms from a different position.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a flat bench next to a cable weigh stack.", "Attach a short bar to the high pulley.", "Lay on your back with your head towards the stack.", "Grip the bar with palms facing you)and extend your arms fully on a slight angle over your head.", "Pull the bar down towards you, curling your arms as much as possible.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "cable" ],
  "images" : [ "\"high-cable-curls-medium-1.png\"", "\"high-cable-curls-medium-2.png\"" ]
}, {
  "title" : "Flexor Incline Curls with Dumbbell",
  "description" : "This exercise was designed to keep the stress on the biceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on an incline bench with your feet firmly on the floor in front of you.", "Grasp a dumbbell with your palms facing up.", "Bring your arms down to your sides and while keeping your wrists as straight as possible, raise your wrists to your shoulders.", "Concentrate on squeezing your biceps as you contract (raise) your arms." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"flexor-incline-curls-with-dumbbell-medium-1.png\"", "\"flexor-incline-curls-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Hammer Curls with Rope and Cable",
  "description" : "Using the rope with the cable machine allows you isolate the biceps with this version of the Hammer Curl. This is a good exercise for beginners.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a rope to a cable pulley to the bottom of the weight stack. Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in. Grasp the rope with a close underhand grip (palms facing up). Lower your arms fully to above your thighs and bending only your elbows, raise the rope to your upper chest. Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"hammer-curls-with-rope-and-cable-medium-1.png\"", "\"hammer-curls-with-rope-and-cable-medium-2.png\"" ]
}, {
  "title" : "Lying Incline Curl with Barbell",
  "description" : "This exercise uses an incline bench to change your body’s position as you perform bicep curls. The movement is very similar to a Preacher Curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust an incline bench to a 45 degree angle.", "Grasp a barbell with a shoulder width grip and lean face down against the bench, with your feet resting on the floor for support.", "Allow your arms to hang down at your sides.", "Keeping your elbows straight, raise the bar up towards your head, contracting your biceps.", "In a controlled manner lower the weight and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"lying-incline-curl-with-barbell-medium-1.png\"", "\"lying-incline-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Alternating Incline Curl with Dumbbell",
  "description" : "This exercise uses an incline bench to change your body’s position as you perform bicep curls.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust an incline bench to a 45 degree angle.", "Grasp a dumbbell in each hand and sit back on the bench with your feet firmly planted on the floor.", "Allow your arms to hang down at your sides.", "Keeping your elbow straight, raise your right arm up towards your head.", "In a controlled manner lower the weight and repeat with your left arm." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"alternating-incline-curl-with-dumbbell-medium-1.png\"", "\"alternating-incline-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Alternating Hammer Curl with Dumbbell",
  "description" : "This exercise uses a hammering (up and down) motion to isolate the biceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with our feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each hand so your palms are facing each other.", "Extend your arms so they are at the sides of your body.", "Keeping your elbows locked lift your left arm in an arc towards your left shoulder.", "Lower your arm and repeat with your right arm." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"alternating-hammer-curl-with-dumbbell-medium-1.png\"", "\"alternating-hammer-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Standing Biceps Curl with Cable",
  "description" : "This version of the biceps curl uses a cable instead of a barbell to work the muscles of the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a short bar to a cable pulley to the bottom of the weight stack.", "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp the bar with palms facing up, and hands fairly close together.", "Lower your arms fully to above your thighs and bending only your elbows, raise the bar to your upper chest.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm", "shoulders" ],
  "equipment" : [ "cable" ],
  "images" : [ "\"standing-biceps-curl-with-cable-medium-1.png\"", "\"standing-biceps-curl-with-cable-medium-2.png\"" ]
}, {
  "title" : "Bicep Curls with Barbell",
  "description" : "This is a basic exercise for the biceps (arms).",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a barbell with palms facing up, approximately shoulder width apart.", "Lower your arms fully to above your thighs and bending only your elbows, raise the bar to your upper chest.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm", "shoulders" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"bicep-curls-with-barbell-medium-1.png\"", "\"bicep-curls-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Triceps Extensions using Machine",
  "description" : "Name: This exercise uses a machine to insure proper range of motion. This is a good exercise for beginners and people rehabilitating from injury.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat height of the machine so your upper arms and elbows lie flat on the pad. Draw your abs in and sit upright with your back straight. With your arms fully extended grasp the handles and pull them towards your body. Hold for a moment and then slowly return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"triceps-extensions-using-machine-medium-1.png\"", "\"triceps-extensions-using-machine-medium-2.png\"" ]
}, {
  "title" : "Triceps Pushdown with V Bar and Cable",
  "description" : "This exercise is the triceps pushdown uses a V shaped bar. Many people find this version easier on the elbows.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand in front of a cable machine and attach a V Bar to a high pulley.", "Grasp the bar with palms facing down.", "Draw your abs in and keep your back straight.", "Keeping your elbows at your side push the bar down towards your thighs.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"triceps-pushdown-with-v-bar-and-cable-medium-1.png\"", "\"triceps-pushdown-with-v-bar-and-cable-medium-2.png\"" ]
}, {
  "title" : "Weighted Ball Side Bend",
  "description" : "This exercise use a Stability Ball instead of a bench. The Stability Ball conforms better to your body and allows for correct anatomical range of movement.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie one side of your torso, and with your waist and hip against a Stability Ball, position your feet on the floor (or against a wall) for support.", "With one hand, hold a weight against the side of your head.", "Place your free hand across your chest to steady yourself.", "Raise your torso up off the ball by flexing your waist.", "With controlled movements lower yourself back onto the ball." ],
  "primaryMusclGroup" : [ "obliques" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "exercise ball", "weight" ],
  "images" : [ "\"weighted-ball-side-bend-medium-1.png\"", "\"weighted-ball-side-bend-medium-2.png\"" ]
}, {
  "title" : "Preacher Curl with Cable",
  "description" : "A Preacher Curl uses a special bench to support the triceps and isolate the biceps to build the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a padded arm curl bench in front of a cable machine.", "Attach a short bar to the bottom pulley.", "Rest your arms against the bench and extend them fully.", "With a narrow grip (6 inches) grasp the bar with palms facing up and pull it towards your head.", "Pause for a moment and then lower the bar back to starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "cable" ],
  "images" : [ "\"preacher-curl-with-cable-medium-1.png\"", "\"preacher-curl-with-cable-medium-2.png\"" ]
}, {
  "title" : "Close Grip EZ Bar Curl with Barbell",
  "description" : "This exercise uses a cambered EZ or curl bar to isolate the biceps during a curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp an EZ bar with an underhand close (4 inch) grip on the innermost part of the bar.", "Extend your arms fully against your thighs.", "Keeping your elbows straight, raise the bar towards your chest.", "Pause for moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"close-grip-ez-bar-curl-with-barbell-medium-1.png\"", "\"close-grip-ez-bar-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Bicep Hammer Curl with Dumbbell",
  "description" : "This exercise uses a hammering (up and down) motion to isolate the biceps.",
  "types" : [ "isolation" ],
  "steps" : [ " Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each hand so your palms are facing each other.", "Extend your arms so they are at the sides of your body.", "Keeping your elbows locked lift your arms in an arc towards your shoulders.", "Lower your arms in a steady controlled motion and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"bicep-hammer-curl-with-dumbbell-medium-1.png\"", "\"bicep-hammer-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "EZ Bar Curl with Barbell",
  "description" : "This exercise uses an EZ or curl bar to better isolate and build the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart and your knees slightly bent.", "Grasp the barbell with palms up.", "Lower the bar so it is against your thighs.", "Keeping your elbows still, raise the bar up to your chest so that your forearms touch your biceps." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"ez-bar-curl-with-barbell-medium-1.png\"", "\"ez-bar-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Prone Incline Biceps Curl with Dumbbell",
  "description" : "This exercise uses an incline bench to change your body’s position as you perform bicep curls. The movement is very similar to a Preacher Curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust an incline bench to a 45 degree angle.", "Grasp dumbbells in each hand and lean face down against the bench, with your feet resting on the floor for support.", "Allow your arms to hang down at your sides.", "Keeping your elbow straight, raise the dumbbells up towards your head, contracting your biceps.", "In a controlled manner, lower the weight and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"prone-incline-biceps-curl-with-dumbbell-medium-1.png\"", "\"prone-incline-biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Biceps Curl with Dumbbell",
  "description" : "This version of a biceps curl uses both arms at the same time.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with our feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each hand with your palms facing up.", "Extend your arms so they are at the sides of your body.", "Keeping your elbows, locked lift your arms to your chest so that your forearms touch your biceps.", "In a slow controlled manner, lower your arms to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"biceps-curl-with-dumbbell-medium-1.png\"", "\"biceps-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Alternating Bicep Curl with Dumbbell",
  "description" : "This exercise is a single arm version of a biceps curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each hand so your palms are facing up.", "Extend your arms so they are at the sides of your body.", "Keeping your elbows locked lift your left arm to your chest so that your forearm touches your bicep.", "Lower your arm and repeat with your right arm." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"alternating-bicep-curl-with-dumbbell-medium-1.png\"", "\"alternating-bicep-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Drag Curl with Barbell",
  "description" : "This exercise is credited to the late Vince Gironda, the “Iron Guru”. It not only blasts the biceps and works the forearms as well.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent, and your abs drawn in.", "Grasp the bar with palms down, shoulder width apart.", "Extend your arms fully so they are against your thighs.", "Slowly raise your arms, palms down, to touch your chest." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"drag-curl-with-barbell-medium-1.png\"", "\"drag-curl-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Cross Body Hammer Curl with Dumbbell",
  "description" : "This exercise targets the biceps using a crossing motion rather than a standard curl.",
  "types" : [ "isolation" ],
  "steps" : [ "While standing, grab a dumbbell in each arm with palms facing in.", "Keeping your palms facing in (and not twisting your arms) curl the dumbbell up towards your opposite shoulder.", "Bring the top of dumbbell up to and touching the shoulder.", "Slowly with a controlled manner, lower the dumbbell back to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"cross-body-hammer-curl-with-dumbbell-medium-1.png\"", "\"cross-body-hammer-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Concentration Curls with Dumbbell",
  "description" : "Concentration exercises limit your range of movement to increase the effectiveness of the movement.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the end of a flat bench with your feet flat and your legs spread apart.", "Grasp a dumbbell in your hand, palms facing up.", "With your elbow pressed against your inner thigh, curl the dumbbell up towards your chest.", "Slowly return to the starting position.", "Repeat and switch arms." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"concentration-curls-with-dumbbell-medium-1.png\"", "\"concentration-curls-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Close Grip Standing Bicep Curls with Barbell",
  "description" : "This exercise uses a standard barbell to isolate the biceps during a curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a barbell with palms up, about 12 inches apart.", "Extend your arms fully against your thighs.", "Keeping your elbows straight, raise the bar towards your chest until your forearms touch your chest.", "Pause for moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"close-grip-standing-bicep-curls-with-barbell-medium-1.png\"", "\"close-grip-standing-bicep-curls-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Incline Triceps Extensions with Dumbbell",
  "description" : "This version of the triceps extension uses an incline bench.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand and lie against an incline bench, face up with your feet firmly planted on the floor.", "Extend your arms over your shoulders with your palms facing each other.", "Slowly lower the dumbbells behind your head by bending your elbows.", "With a controlled motion raise your arms back up to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"incline-triceps-extensions-with-dumbbell-medium-1.png\"", "\"incline-triceps-extensions-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Zottman Preacher Curl with Dumbbells",
  "description" : "This is an advanced exercise where you turn the dumbbells up and out using a Preacher Curl bench for support.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit at a Preacher Curl Bench.", "Grasp a dumbbell in your hand with your palms facing up.", "Extend your arm fully along the bench.", "Curl your arm up turning your wrist so it faces down as the dumbbell reaches your chest.", "Pause for a moment and then return to the starting position and switch arms." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"zottman-preacher-curl-with-dumbbells-medium-1.png\"", "\"zottman-preacher-curl-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Side Bend with Dumbbell",
  "description" : "This exercise works the obliques, the muscles on the sides of your abs.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in one hand and standing straight upright, bend at the waist as far as possible to one side.", "Slowly return back up to the staring position.", "Switch the dumbbell to your other hand and repeat the exercise." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"side-bend-with-dumbbell-medium-1.png\"", "\"side-bend-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Ab Rollout with Barbell",
  "description" : "This exercise works the abs and lower back and is the proper version of an “ab roller”.",
  "types" : [ "compound" ],
  "steps" : [ "Place a barbell on the floor at your feet.", "Bending at the waist, grip the barbell with a shoulder with overhand grip.", "With a slow controlled motion, roll the bar out so that your back is straight.", "Keep your arms straight throughout the exercise.", "Roll back up raising your hips and butt as you return to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ "lower back", "shoulders" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"ab-rollout-with-barbell-medium-1.png\"", "\"ab-rollout-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Air Bike",
  "description" : "This exercise works your abs by raising your arms to meet your legs. The movements are similar to riding a bike.",
  "types" : [ "compound" ],
  "steps" : [ "Lie on your back on a mat.", "Place your hands on either side of your head (over your ears).", "Raise your legs up, bending your knees and keeping your calves parallel to the floor.", "Bring your left arm elbow up to meet your right knee, as if riding a bike.", "Repeat with your right elbow and left knee.", "Continue alternating sides." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"air-bike-medium-1.png\"", "\"air-bike-medium-2.png\"" ]
}, {
  "title" : "Standing Calf Raise with Dumbbell",
  "description" : "This version of a Calf Raise uses dumbbells.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a block or two free weight plates on the floor.", "Grasp a dumbbell in each hand and step up so the balls of your feet are on the block.", "Slowly lift your heels up and then lower them back to the floor getting as much of a stretch as possible.", "Lower your heels and bend your ankles to stretch your calves.", "Return to starting position." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ ]
}, {
  "title" : "Standing Calf Raises using Machine",
  "description" : "This exercise uses a machine to allow for proper form.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your toes on the footpad of the machine and adjust your shoulders under the upper pads.", "Raise up on the balls of your feet, lifting your heels off the pad.", "Hold for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"standing-calf-raises-using-machine-medium-1.png\"", "\"standing-calf-raises-using-machine-medium-2.png\"" ]
}, {
  "title" : "Standing Barbell Calf Raise",
  "description" : "This is standing version of a Calf Raise.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a block or two free weight plates on the floor.", "Place a barbell across your back and step up so the balls of your feet are on the block.", "Slowly lift your heels up and then lower them back to the floor getting as much of a stretch as possible.", "Return to starting position." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"standing-barbell-calf-raise-medium-1.png\"", "\"standing-barbell-calf-raise-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Reverse Calf Raises",
  "description" : "This is a unique exercise that works the tibialis anterior muscle, one of the muscles of the calves.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a block or low box under the bar at a Smith Machine.", "Stand on the edge of the box with your toes hanging off.", "Place the bar across your shoulders and lean forward lifting your ankles off the box.", "Return to the starting position." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-reverse-calf-raises-medium-1.png\"", "\"smith-machine-reverse-calf-raises-medium-2.png\"" ]
}, {
  "title" : "Seated Calf Raise using Machine",
  "description" : "This is one of the simplest and most effective exercises for the calves.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit at a calf raise machine.", "Put the balls of your feet on the footpad.", "Place your thighs under the leg pad above your knees.", "Unlock the bar and slowly raise your toes up as far as possible.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"seated-calf-raise-using-machine-medium-1.png\"", "\"seated-calf-raise-using-machine-medium-2.png\"" ]
}, {
  "title" : "Rocking Standing Calf Raise with Barbell",
  "description" : "This exercise uses a simple rocking motion to strengthen the calves.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with a bar across your shoulders.", "With your feet flat on the floor, lift your feet up and forward as if you are performing a calf raise.", "Then “rock” back onto your ankles so your toes are flexed and off the floor.", "Return to starting position." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"rocking-standing-calf-raise-with-barbell-medium-1.png\"", "\"rocking-standing-calf-raise-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Knee Circles",
  "description" : "This is a simple exercise and a great stretch.",
  "types" : [ "compound" ],
  "steps" : [ "Stand with your feet a little closer than shoulder width apart.", "Keeping your arms across your chest or on your hips, move your knees in a circular motion, paying attention to keeping your feet flat on the floor and the movement in your ankles." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "body" ],
  "images" : [ "\"knee-circles-medium-1.png\"", "\"knee-circles-medium-2.png\"" ]
}, {
  "title" : "Ab Rollout on Knees with Barbell",
  "description" : "This exercise works the abs and lower back and is the proper version of an “ab roller”. This version is performed on your knees.",
  "types" : [ "compound" ],
  "steps" : [ "Place a barbell on the floor in front of you.", "Start by kneeling in front of the bar, grip the barbell with a shoulder with overhand grip.", "With a slow controlled motion, roll the bar out so that your back is straight, bend your knees and keep your feet off the floor.", "Keep your arms straight throughout the exercise.", "Roll back up bring the bar under your shoulders and return to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ "lower back", "shoulders" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"ab-rollout-on-knees-with-barbell-medium-1.png\"", "\"ab-rollout-on-knees-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Bent Knee Hip Raise",
  "description" : "This is a good exercise core muscle development.",
  "types" : [ "compound" ],
  "steps" : [ "Lie on your back with your arms outstretched to your sides.", "Bend your knees at a 60 degree angle and hold your feet up just off the floor.", "Keeping your back and arms down, raise your hips up and off the floor so that your knees are over your chest.", "Contract your abs for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"bent-knee-hip-raise-medium-1.png\"", "\"bent-knee-hip-raise-medium-2.png\"" ]
}, {
  "title" : "Stability Ball Abdominal Crunch",
  "description" : "This crunch uses a Stability Ball. The ball allows you a better range of movement because it adapts better to your spine.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on top of an exercise or stability ball with your feet placed firmly on the floor for support.", "Position yourself so that your lower back is centered on the middle of the ball.", "Lie back and bring your hands across your chest, or on either side of your head (over your ears).", "Raise your head, chest and shoulders up crunching your abs as you sit upright.", "Pause for a moment and then lower yourself to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"stability-ball-abdominal-crunch-medium-1.png\"", "\"stability-ball-abdominal-crunch-medium-2.png\"" ]
}, {
  "title" : "Decline Oblique Crunch",
  "description" : "This version of a decline crunch isolates the oblique (side) muscles of the abs.",
  "types" : [ "compound" ],
  "steps" : [ "Lie on a decline bench face up.", "Place your feet securely under the pads.", "Place your hands either across your chest or on either side of your head (over your ears).", "Raise your shoulders and chest up keeping your back straight and bring your left elbow to your right knee, slowly crunching your abs.", "Pause for a moment and then return to the starting position.", "Lay fully back and repeat with your right elbow to your left knee." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"decline-oblique-crunch-medium-1.png\"", "\"decline-oblique-crunch-medium-2.png\"" ]
}, {
  "title" : "Decline Crunch",
  "description" : "Using a decline crunch allows you keep your legs steady and isolate all of the abdominal muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a decline bench face up.", "Place your feet securely under the pads.", "Place your hands either across your chest or on either side of your head (over your ears).", "Lay fully back and then rise slowly crunching your abs.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"decline-crunch-medium-1.png\"", "\"decline-crunch-medium-2.png\"" ]
}, {
  "title" : "Exercise Ball Pull In",
  "description" : "This exercise uses a ball to isolate and work the lower abdominal muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Lay down as if you were performing a pushup.", "Place your feet and shins over an exercise or stability ball.", "Keeping your back straight and supporting your weight on your hands, pull your knees towards your chest, so the ball rolls forward under your ankles.", "Crunch your abs and then roll the ball back to starting position straighten your legs." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"exercise-ball-pull-in-medium-1.png\"", "\"exercise-ball-pull-in-medium-2.png\"" ]
}, {
  "title" : "Bent Over Row with Barbell",
  "description" : "This exercise focuses on the middle back.",
  "types" : [ "compound" ],
  "steps" : [ "Place your feet shoulder width apart.", "Bend over the bar so your back is flat and parallel to the floor.", "Grasp the bar a bit wider than shoulder width apart with an overhand grip.", "Hold the bar at arms length, this is starting position.", "Slowly raise the bar to the lower part of your chest.", "Pause for a moment than return to starting position." ],
  "primaryMusclGroup" : [ "middle back" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ ]
}, {
  "title" : "Crunches",
  "description" : "This is the most common abdominal exercise and possibly the most often improperly performed. Here is how to perform it correctly.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on your back with your feet up on a bench and your knees bent at a 90 degree angle.", "Place your hands across your chest or on either side of your head (over your ears).", "Raise your head, shoulders and chest off the floor and towards your knees, crunching your abs.", "Hold the position for a moment and then lower to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"crunches-medium-1.png\"", "\"crunches-medium-2.png\"" ]
}, {
  "title" : "Crunches with Legs on Stability Ball",
  "description" : "This exercise uses a Stability Ball as the base during your crunches.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on your back and place your feet up on a stability ball.", "Place your hands across your chest, or on either side of your head.", "Keeping the small of your back on the floor, raise your head, shoulders and chest up and off the floor.", "Pause for a moment contracting your abs and then return to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "stability ball" ],
  "images" : [ "\"crunches-with-legs-on-stability-ball-medium-1.png\"", "\"crunches-with-legs-on-stability-ball-medium-2.png\"" ]
}, {
  "title" : "Cross Body Crunch",
  "description" : "This version of the crunch works both the upper and lower portion of the abs.",
  "types" : [ "compound" ],
  "steps" : [ "Lie on your back and bring your knees up to a 60 degree angle, keep your feet flat on the floor.", "Place your hands on either side of your head (over your ears).", "Curl up raising your right elbow and your left knee so that they touch over your chest.", "Return to the starting position and repeat with alternate arms and legs." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"cross-body-crunch-medium-1.png\"", "\"cross-body-crunch-medium-2.png\"" ]
}, {
  "title" : "Seated Ab Crunch with Cable",
  "description" : "This exercise uses the weight of a cable machine to assist in a crunch.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a rope to a high cable pulley.", "Place a bench in front of cable weight stack.", "Grasp the rope over your shoulders and sit with your back towards the stack.", "With your feet firmly on the floor and keeping your hips steady, flex at the waist bringing your elbows towards your knees.", "Return to the starting position." ],
  "primaryMusclGroup" : [ "abdominals" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"seated-ab-crunch-with-cable-medium-1.png\"", "\"seated-ab-crunch-with-cable-medium-2.png\"" ]
}, {
  "title" : "Seated One Leg Calf Raise with Dumbbell",
  "description" : "This version of a calf raise allows you to exercise each leg individually. This exercise is helpful to people who are rehabilitating from injury as it allows you flexibility with the weight.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a block on the floor about one foot in front of a bench.", "Sit on the bench with a dumbbell across your upper thigh and the balls of one foot on the block.", "Slowly raise and lower your toe up as high as possible without lifting your foot off the block.", "Switch feet and repeat." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"seated-one-leg-calf-raise-with-dumbbell-medium-1.png\"", "\"seated-one-leg-calf-raise-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Donkey Calf Raises",
  "description" : "This is an old school gym exercise which requires the assistance of another person. This is an advanced exercise and not recommended for beginners.",
  "types" : [ "isolation" ],
  "steps" : [ "Bend your waist and lean your arms against a weight rack or bench that is waist height.", "Have a partner sit on top of your lower back.", "Raise up on your toes leaning slightly forward.", "Pause at the top and then lower your heels to the floor." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"donkey-calf-raises-medium-1.png\"", "\"donkey-calf-raises-medium-2.png\"" ]
}, {
  "title" : "Calf Raises with Band",
  "description" : "This exercise uses a band to create resistance.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your toes on an exercise band and raise the handles up to your shoulders.", "Raise up on your toes, keeping your hands up by your shoulders.", "Pause for a moment and then lower your heel to the floor.", "Repeat." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "bands" ],
  "images" : [ "\"calf-raises-with-band-medium-1.png\"", "\"calf-raises-with-band-medium-2.png\"" ]
}, {
  "title" : "Bicep Curl Lunge with Bowling Motion",
  "description" : "This exercise is similar to the motions of bowling.",
  "types" : [ ],
  "steps" : [ "Hold a Medicine Ball in one hand with your palms facing up at shoulder height.", "Bring one foot back and into a lunge, keeping your front foot stationary and not letting your back knee touch the ground.", "While lunging, bring the ball down and back as if you were bowling.", "Bring your arm back up to the starting position, switch legs and repeat." ],
  "primaryMusclGroup" : [ "arms" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings", "quadriceps", "triceps" ],
  "equipment" : [ "medicine ball" ],
  "images" : [ "\"bicep-curl-lunge-with-bowling-motion-medium-1.png\"", "\"bicep-curl-lunge-with-bowling-motion-medium-2.png\"" ]
}, {
  "title" : "Quick Alternating Bicep Curls with Band",
  "description" : "This exercise uses a bungy or exercise band for resistance.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a bungy under your feet and hold the handles palms forward in your hands.", "Stand with your feet shoulder width apart, knees slightly bent and your abs drawn in.", "Curl your arms up and down in an alternating motion, keeping your body straight.", "As you become comfortable with the motion, increase your speed." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "triceps" ],
  "equipment" : [ "band" ],
  "images" : [ "\"quick-alternating-bicep-curls-with-band-medium-1.png\"", "\"quick-alternating-bicep-curls-with-band-medium-2.png\"" ]
}, {
  "title" : "Biceps Curl with Overhead Extension using Dumbbells on Stability Ball",
  "description" : "This is an advanced exercise. This exercise requires you to be able to balance kneeling on a stability ball before you can correctly perform this exercise.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand with palms facing up.", "Kneel on a Stability Ball, drawing your abs in and keeping your back straight.", "Raise one arm up over your shoulder and keep your other arm curled.", "Bend your raised arm back as if performing a triceps extension while lowering your other arm and curling it back.", "Return to starting position and repeat arms." ],
  "primaryMusclGroup" : [ "biceps", "triceps" ],
  "secondaryMuscleGroup" : [ "forearm", "should" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"biceps-curl-with-overhead-extension-using-dumbbells-on-stability-ball-medium-1.png\"", "\"biceps-curl-with-overhead-extension-using-dumbbells-on-stability-ball-medium-2.png\"" ]
}, {
  "title" : "Bicep Curl with Deadlift with Barbell",
  "description" : "This is an advanced exercise. This exercise combines a bicep curl with a deadlift.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp an EZ Curl or barbell with palms facing up.", "Standing with your feet shoulder width apart and your knees slightly bent, draw your abs in.", "Extend your arms so the bar rests in front of your thighs.", "Bending at the waist, bring the bar down to just above the floor.", "As you return to a standing position, bring the bar up and curl your arms bringing your forearms to your biceps.", "Return the starting position and repeat." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings", "lower back" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"bicep-curl-with-deadlift-with-barbell-medium-1.png\"", "\"bicep-curl-with-deadlift-with-barbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Bicep Concentration on Stability Ball with Dumbbell",
  "description" : "This exercise uses a Stability Ball instead of a bench for better form.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in one hand and sit on a Stability Ball with your feet wide apart.", "Bend forward leaning at the waist.", "With the dumbbell in your hand, place your elbow against your knee.", "Lower your arm so it is flat against your calves.", "Curl your arm up to your chest keeping your elbow steady.", "Return to starting position and change hands." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"one-arm-bicep-concentration-on-stability-ball-with-dumbbell-medium-1.png\"", "\"one-arm-bicep-concentration-on-stability-ball-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Biceps Curl Reverse with Dumbbells",
  "description" : "This is a reverse curl exercise that works all of the muscles of the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each hand with palms facing down.", "Keeping your arms at your side your elbows steady, lift the dumbbells up towards your shoulders.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"biceps-curl-reverse-with-dumbbells-medium-1.png\"", "\"biceps-curl-reverse-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Biceps Curl Squat with Dumbbell",
  "description" : "This exercise combines a squat with a curl to effectively work the entire body. This is an advanced exercise.",
  "types" : [ "compound", "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your knees slightly bent and your abs drawn in.", "Grasp a dumbbell in each hand and curl your arms up to your shoulders.", "Bending at the waist, squat down as you lower your hands to the floor (the lower part of a curl).", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "glutes", "hamstrings" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"biceps-curl-squat-with-dumbbell-medium-1.png\"", "\"biceps-curl-squat-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Biceps Curl Seated on Stability Ball with Dumbbell",
  "description" : "This version of a biceps curl uses a Stability Ball. Exercises preformed with Stability Balls encourage better posture and core muscle development.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand while sitting on a Stability Ball with your feet placed firmly in front of you, and your abs drawn in.", "Keeping your elbows at your side and your back straight, curl your arms up to your chest.", "Pause for a moment, contracting your biceps.", "Slowly lower your arms to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"biceps-curl-seated-on-stability-ball-with-dumbbell-medium-1.png\"", "\"biceps-curl-seated-on-stability-ball-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Bicep Curl with Olympic Bar or Barbell",
  "description" : "This is an advanced exercise for building stability and the muscles of the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart and your knees slightly bent.", "Grasp an Olympic bar (empty weight bar) in the middle with one hand so that the bar is equally balanced.", "Keep your free hand at your side for support.", "Curl the bar up so your forearm touches your bicep.", "Slowly lower the bar and change arms." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"one-arm-bicep-curl-with-olympic-bar-or-barbell-medium-1.png\"", "\"one-arm-bicep-curl-with-olympic-bar-or-barbell-medium-2.png\"" ]
}, {
  "title" : "Bicep Curl on Stability Ball with Leg Raised",
  "description" : "This exercise incorporates balance along with a bicep curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand with a palms up grip.", "Place the top of one foot behind you on a Stability Ball (see illustration) as if you were stretching your leg.", "Keep your back straight and your abs drawn in.", "Bring your arms down in front of your legs.", "Raise your arms up, curling and contracting your biceps.", "Lower your arms and return to starting position and switch legs." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "calves", "forearm", "hamstring", "quadriceps" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"bicep-curl-on-stability-ball-with-leg-raised-medium-1.png\"", "\"bicep-curl-on-stability-ball-with-leg-raised-medium-2.png\"" ]
}, {
  "title" : "Lateral Lunge with Bicep Curl with Dumbbell",
  "description" : "This is an advanced exercise that combines a lateral lunge with a bicep curl.",
  "types" : [ "compound", "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand with your palms facing up.", "Stand with your feet together, your back straight and your abs drawn in.", "Allow your arms to extend down fully in front of your thighs.", "While keeping your body straight, take a step sideways and then bend your waist and your knee into a lunge.", "As you go into the lunge, curl your arms up towards your shoulders contracting your biceps.", "Return to starting position and switch legs." ],
  "primaryMusclGroup" : [ "biceps", "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "forearm", "glutes", "hamstrings", "hip abductors" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"lateral-lunge-with-bicep-curl-with-dumbbell-medium-1.png\"", "\"lateral-lunge-with-bicep-curl-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Calves Press on Leg Machine",
  "description" : "This exercise uses a Leg Press Machine to work your calves. You can perform this exercise along with Leg Presses.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit down on a Leg Press Machine and press the plate up as if you were performing a leg press.", "Slide your feet down so that the balls of your feet are pressing against the rack (with your heels hanging free).", "Keeping the handles locked, press up and flex your toes and then slowly bring your toes back towards your body.", "Perform theses movements slowly for maximum benefit." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"calves-press-on-leg-machine-medium-1.png\"", "\"calves-press-on-leg-machine-medium-2.png\"" ]
}, {
  "title" : "Seated Calf Raise with Barbell",
  "description" : "This version of a calves raise uses a block and a barbell.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a block on the floor about one foot in front of a bench.", "Sit on the bench with a barbell across your upper thighs and the balls of your feet on the block.", "Slowly raise and lower your toes up as high as possible without lifting your foot off the block." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"seated-calf-raise-with-barbell-medium-1.png\"", "\"seated-calf-raise-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Balance Board",
  "description" : "Your calves are stabilizing muscles for your legs, so this exercises uses a Balance Board or wobble board to force you to balance.",
  "types" : [ "compound" ],
  "steps" : [ "Place a Balance Board on the floor.", "Step onto the board with both feet and try to balance yourself." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ "hamstring", "quadriceps" ],
  "equipment" : [ "balance board" ],
  "images" : [ "\"balance-board-medium-1.png\"", "\"balance-board-medium-2.png\"" ]
}, {
  "title" : "Ankle Circles",
  "description" : "This is the most simple of all exercises for the calves.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand on one foot near a chair or wall for support.", "Lift your foot off the ground and draw circles clockwise in the air with your toes.", "Reverse the direction (counter-clockwise) as well as switch feet." ],
  "primaryMusclGroup" : [ "calves" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"ankle-circles-medium-1.png\"", "\"ankle-circles-medium-2.png\"" ]
}, {
  "title" : "Biceps Curl V Sit on Dome with Dumbbells",
  "description" : "This exercise uses a Dome (or Bosu) as a seat forcing you to engage and contract your abs throughout the exercise. The name comes from having our body in the shape of a “V”.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand and sit on a dome.", "Keep your legs together and your knees bent.", "Draw in and hold your abs and keep your back straight.", "With you arms extended to your sides, curl and contract your biceps, bringing your forearms towards your shoulders.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "abdominals", "core" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"biceps-curl-v-sit-on-dome-with-dumbbells-medium-1.png\"", "\"biceps-curl-v-sit-on-dome-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Stork Stance Bicep Curl with Dumbbells",
  "description" : "This is an advanced exercise that requires excellent coordination and balance.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a pair of dumbbells in each hand, palms facing up.", "Standing on one foot, extend your other foot back (see illustration) and extend your arms down so they are handing in front of your leg.", "While on one foot, curl your arms up contracting your biceps.", "Return to the starting position and switch legs." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings", "quadriceps", "triceps" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"stork-stance-bicep-curl-with-dumbbells-medium-1.png\"", "\"stork-stance-bicep-curl-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Medicine Ball Biceps Curl on Stability Ball",
  "description" : "This exercise combines a new technology, Stability Ball, with a old piece of fitness equipment, the Medicine Ball.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on a Stability Ball with your feet firmly on the floor in front of you.", "Sit with your back straight, your shoulders back and your abs drawn in.", "Hold a Medicine Ball in one hand and curl it up bringing your forearm up to your bicep.", "Return to starting position and switch arms." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "core", "forearm" ],
  "equipment" : [ "medicine ball" ],
  "images" : [ "\"medicine-ball-biceps-curl-on-stability-ball-medium-1.png\"", "\"medicine-ball-biceps-curl-on-stability-ball-medium-2.png\"" ]
}, {
  "title" : "Step Up Single Leg Balance with Bicep Curl using Dumbbells",
  "description" : "This is an advanced exercise. This exercise combines a step up with a bicep curl.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a box or bench in front of you.", "Place a dumbbell in each hand with palms facing up.", "Keep your back straight, your shoulders back and your abs drawn in.", "With one leg, step up on to the box and raise your other leg up (as if taking another step).", "At the top of the step, curl your arms up by bringing your biceps towards your shoulders.", "Return to the starting position and switch legs." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "calves", "core", "forearm", "glutes", "hamstrings", "quadriceps" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"step-up-single-leg-balance-with-bicep-curl-using-dumbbells-medium-1.png\"", "\"step-up-single-leg-balance-with-bicep-curl-using-dumbbells-medium-2.png\"", "\"step-up-single-leg-balance-with-bicep-curl-using-dumbbells-medium-3.png\"" ]
}, {
  "title" : "Forward Lunge with Bicep Curl using Dumbbell",
  "description" : "This exercise combines a forward lunge with a bicep curl.",
  "types" : [ "compound", "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand with your palms facing up.", "Stand with your feet together, your back straight and your abs drawn in.", "Allow your arms to extend down fully to the sides of your body.", "While keeping your body straight, take a step forward then bend your waist and your knee into a lunge.", "Be careful not to let your back knee drop to the floor.", "As you go into the lunge, curl your arms up towards your shoulders, contracting your biceps.", "Return to starting position and switch legs." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "calves", "forearm", "glutes", "hamstrings", "hip abductors" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"forward-lunge-with-bicep-curl-using-dumbbell-medium-1.png\"", "\"forward-lunge-with-bicep-curl-using-dumbbell-medium-2.png\"", "\"forward-lunge-with-bicep-curl-using-dumbbell-medium-3.png\"" ]
}, {
  "title" : "Bicep Curl with Machine",
  "description" : "This exercise uses a machine to insure proper form.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat of the machine so your elbows are correctly aligned with the rotation axis.", "Press your arms against the pads and keep them stationary throughout the exercise.", "Curl your forearms until your arms are fully flexed.", "Slowly lower your arms back to the starting position." ],
  "primaryMusclGroup" : [ "biceps" ],
  "secondaryMuscleGroup" : [ "forearm" ],
  "equipment" : [ ],
  "images" : [ "\"bicep-curl-with-machine-medium-1.png\"", "\"bicep-curl-with-machine-medium-2.png\"" ]
}, {
  "title" : "Wide Stance Squat with Barbell",
  "description" : "This version of the squat uses a wider stance to isolate the inner thigh.",
  "types" : [ "compound" ],
  "steps" : [ "Lifting a barbell off of a weight rack, position it on your shoulders.", "Stand with your feet wider than shoulder width apart (about 30 inches apart) with your toes pointing out.", "Drawing your abs in descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"wide-stance-squat-with-barbell-medium-1.png\"", "\"wide-stance-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Narrow Stance Hack Squats",
  "description" : "Like the Hack Squat, this exercise works the muscles of the leg. The narrow stance targets the external muscles more efficiently.",
  "types" : [ "compound" ],
  "steps" : [ "Lie face up on a Hack Squat machine with your shoulders against the pad.", "Place your feet facing forward at a distance of 6 inches apart with your toes point slightly outward.", "Release the dock levers and place your hands on the handgrips.", "Drawing your abs in, extend your body standing upright.", "Lower your body to a squatting position so your knees are bent as if you were sitting down.", "Return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"narrow-stance-hack-squats-medium-1.png\"", "\"narrow-stance-hack-squats-medium-2.png\"" ]
}, {
  "title" : "Lying Squat",
  "description" : "This exercise is similar to a Leg Press Machine working the same muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Adjust the shoulder rack of the machine so that your feet comfortably reach the crosspiece with a slight bend in your knees.", "To begin, press your feet forward and release the safety locks.", "Slowly lower the weight towards your body, keeping your abs drawn in and your knees moving in the same direction as your feet to a 90 degree angle.", "Do not lock your knees or bounce the weight." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"lying-squat-medium-1.png\"", "\"lying-squat-medium-2.png\"" ]
}, {
  "title" : "Narrow Stance Leg Press",
  "description" : "This is a variation of the leg press which targets more of the external muscles of the legs by moving your feet closer together.",
  "types" : [ "compound" ],
  "steps" : [ "Sit on a leg press machine with your feet on the crosspiece 6 inches apart, with your toes pointed slightly outward.", "Grasp the handles on the side of the machine and release the locks.", "Keeping your abs drawn in, bend your knees and bring the weight as far as possible towards your chest.", "Hold this position for a moment and then slowly return the weight to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstring" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"narrow-stance-leg-press-medium-1.png\"", "\"narrow-stance-leg-press-medium-2.png\"" ]
}, {
  "title" : "Leg Extensions",
  "description" : "This exercise is a staple for building strong legs.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the seat so that your knees have full range of motion and that the footpad fits over your legs, just above your ankles.", "Grasp the handles with your hands for support, keeping your hip and back against the bench.", "Slowly extend your legs until your knees are straight, but do not lock your knees.", "Hold for a moment and then with controlled movements return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"leg-extensions-medium-1.png\"", "\"leg-extensions-medium-2.png\"" ]
}, {
  "title" : "Jefferson Squats with Barbell",
  "description" : "This is a rarely used exercise which is without question one of the best exercises for building and shaping the inner thighs.",
  "types" : [ "compound" ],
  "steps" : [ "Place a barbell between your legs so it is perpendicular to your feet.", "Grasp the barbell with one hand in front of you and one hand behind you with an overhand grip.", "Squatting down so your thighs are parallel to the floor slowly lift the weight up between your legs as you stand.", "Slowly return to a starting position just above the floor." ],
  "primaryMusclGroup" : [ "hamstrings" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"jefferson-squats-with-barbell-medium-1.png\"", "\"jefferson-squats-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Iron Cross with Dumbbells",
  "description" : "This is an advanced exercise that works the whole body.",
  "types" : [ "compound" ],
  "steps" : [ "With a dumbbell in each hand, stand in a low squat stance, your feet shoulder width arms held out in front of you with your palms facing in.", "Standing upright, move your arms out and away from your body forming a “T” or “cross”." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "glutes", "hamstrings", "lower back", "shoulders", "trapezius" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"iron-cross-with-dumbbells-medium-1.png\"", "\"iron-cross-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Front Squat to Bench with Barbells",
  "description" : "The Front Squat works the same muscles as the rear squat without placing the weight of the bar on your shoulders. This exercise can be a good substitute for people with back and neck injuries. By using a bench you remind yourself how far to squat down",
  "types" : [ "compound" ],
  "steps" : [ "Place a bench behind you.", "Place the barbell on your upper chest, resting it across your front deltoids and holding it with your arms crossed securely.", "Keep your head and back straight, abs drawn in and your toes pointing slightly outward.", "Slowly “squat” down so your upper thighs are parallel to the floor.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"front-squat-to-bench-with-barbells-medium-1.png\"", "\"front-squat-to-bench-with-barbells-medium-2.png\"" ]
}, {
  "title" : "Front Squat with Barbell",
  "description" : "The Front Squat works the same muscles as the rear squat without placing the weight of the bar on your shoulders. This exercise can be a good substitute for people with back and neck injuries.",
  "types" : [ "compound" ],
  "steps" : [ "Place the barbell on your upper chest, resting it across your front deltoids and holding it with your arms crossed securely.", "Keep your head and back straight, abs drawn in and toes pointing slightly outward.", "Slowly “squat” down so your upper thighs are parallel to the floor.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"front-squat-with-barbell-medium-1.png\"", "\"front-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Step Ups with Dumbbells",
  "description" : "This exercise builds coordination as well as muscle.",
  "types" : [ "compound" ],
  "steps" : [ "Place a bench, box or step in front of you.", "Grasp a dumbbell in each hand.", "With your left leg, step up on the bench, and follow by stepping up with your right leg.", "Step down with your left leg and then your right leg.", "Repeat starting with your right leg." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"step-ups-with-dumbbells-medium-1.png\"", "\"step-ups-with-dumbbells-medium-2.png\"", "\"step-ups-with-dumbbells-medium-3.png\"" ]
}, {
  "title" : "Narrow Stance Squat with Barbell",
  "description" : "A great overall exercise for the lower body. This version of the Squat targets and defines more of the externals leg muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Lifting a barbell off of a weight rack, position it on your shoulders.", "Place your feet about 6 inches apart with your knees and toes pointed slightly outward.", "Drawing your abs in, descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"narrow-stance-squat-with-barbell-medium-1.png\"", "\"narrow-stance-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "One Leg Squat with Barbell",
  "description" : "The One Leg Squat isolates the muscles of the leg for optimal exercise. This exercise is also used to build or rebuild strength after injury.",
  "types" : [ "compound" ],
  "steps" : [ "Place a bench or box 12-18 inches tall behind you. The taller the box the greater the difficulty of the exercise.", "Lifting a barbell off of a weight rack, position it on your shoulders.", "Place one foot up on the bench, and your other foot firmly on the floor 2-3 feet in front you.", "Drawing your abs in descend slowly by bending your front knee and hip as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toe (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position.", "Switch legs and repeat." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"one-leg-squat-with-barbell-medium-1.png\"", "\"one-leg-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Weighted Sissy Squat with Weight Plate",
  "description" : "Don’t let the name of this exercise fool you, it is a an assisted squat which effectively works the quadriceps (leg muscles).",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a weight rack or bar for support with one arm and hold a free weight plate across your chest with your other hand.", "With your abs drawn in, squat down lowering your body to the floor until your knees are almost fully flexed.", "Return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "weight plate" ],
  "images" : [ "\"weighted-sissy-squat-with-weight-plate-medium-1.png\"", "\"weighted-sissy-squat-with-weight-plate-medium-2.png\"" ]
}, {
  "title" : "Thigh Adductor",
  "description" : "This exercise targets and works the muscles of the inner thigh.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the machine and place your knees against the pads.", "Draw your abs in and “adduct” or move your thighs together.", "Slowly return to the starting position and repeat." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"thigh-adductor-medium-1.png\"", "\"thigh-adductor-medium-2.png\"" ]
}, {
  "title" : "Thigh Abductor",
  "description" : "This exercise targets and works the muscles of the outer thigh.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the machine and place your knees against the pads.", "Draw your abs in and “abduct” or move your thighs apart against the pads.", "Slowly return to the starting position and repeat." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "hamstrings" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"thigh-abductor-medium-1.png\"", "\"thigh-abductor-medium-2.png\"" ]
}, {
  "title" : "Squats with Exercise Bands",
  "description" : "This version of the Squat uses flexible exercise bands for resistance instead of weights.",
  "types" : [ "compound" ],
  "steps" : [ "Stand with your feet on the exercise bands with your feet shoulder width apart.", "Grasp the handles of the bands and pull them up to your shoulders.", "With your abs drawn in, squat down until your thighs are parallel with the floor.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings" ],
  "equipment" : [ "exercise band" ],
  "images" : [ "\"squats-with-exercise-bands-medium-1.png\"", "\"squats-with-exercise-bands-medium-2.png\"" ]
}, {
  "title" : "Speed Squats with Barbell",
  "description" : "This version of the squat uses an empty barbell and moves at a faster pace than the standard squat. This is a good exercise for building speed and conditioning used in running and jumping sports.",
  "types" : [ "compound" ],
  "steps" : [ "Place your feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in, descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"speed-squats-with-barbell-medium-1.png\"", "\"speed-squats-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Pile Squat with Dumbbell",
  "description" : "This version of the squat is done with a dumbbell and mimics the action of a pile driver.",
  "types" : [ "compound" ],
  "steps" : [ "Stand with your feet 2-4 inches wider than your shoulders, with your toes pointed out at a 45 degree angle.", "Grasp a dumbbell with both hands in the center of your body.", "Keep your knees slightly bent and your back straight.", "Squat down as if you were going to sit in a chair, bringing your thighs parallel to the floor.", "With a controlled motion return to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"pile-squat-with-dumbbell-medium-1.png\"", "\"pile-squat-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Overhead Squat with Barbell",
  "description" : "In this version of the squat you hold the bar overhead as you perform the exercise.",
  "types" : [ "compound" ],
  "steps" : [ "Stand with your feet a bit wider than shoulder width apart with your toes pointed slightly outward.", "Grasp a barbell using a wide side snatch grip with your arms and elbows fully extended.", "Keeping the bar overhead, bend your knees and lower your body until your thighs are parallel with the floor.", "Return to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings", "lower back", "shoulders" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"overhead-squat-with-barbell-medium-1.png\"", "\"overhead-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Side Deadlift with Barbell",
  "description" : "This is an advanced exercise that works most of the muscles of the body. Exercises like this are used to develop functional strength for sports that require strong hands.",
  "types" : [ "compound" ],
  "steps" : [ "Stand besides a barbell placed on the floor.", "Grasp the bar with an overhand grip in the center.", "Crouching down as if your were performing a squat, bend down so your thighs are parallel with the floor.", "Extend your legs slowly as you straighten your body up, drawing in your abs as you rise." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "abdominals", "calves", "glutes", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"one-arm-side-deadlift-with-barbell-medium-1.png\"", "\"one-arm-side-deadlift-with-barbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Snatch with Barbell",
  "description" : "This is an advanced exercise that works most of the muscles of the body. Exercises like this are used to develop functional strength for sports that require strong hands.",
  "types" : [ "compound" ],
  "steps" : [ "Stand with your feet shoulder width apart, and a slight bend in your knees.", "Grasp the bar with an overhead grip.", "Starting with the barbell held slightly above the knees (hang position), lift the weight up over your head (step 1) then back to shoulder height (step 2) and finally back to starting position between near your knees." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "abdominals", "calves", "hamstrings", "lower back", "shoulders", "trapezius" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"one-arm-snatch-with-barbell-medium-1.png\"", "\"one-arm-snatch-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Squat to Bench with Dumbbells",
  "description" : "This is a great overall exercise for the lower body. There are many variations on the squat, this one uses a bench to remind you how far down to squat.",
  "types" : [ "compound" ],
  "steps" : [ "Place a bench behind you.", "Grasp a dumbbell in each hand.", "Place your feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in descend slowly by squatting down and bending at the knees and hips.", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "hamstring" ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"squat-to-bench-with-dumbbells-medium-1.png\"", "\"squat-to-bench-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Hip Adduction",
  "description" : "This exercises strengthens hip flexors and muscles of the thighs.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand alongside a cable pulley stack and attach a cuff to the pulley and your ankle.", "Step away from the stack, holding onto the stack for support.", "Standing firm on the foot not attached to the cable and slowly abduct, or pull, your cuffed ankle in front of your stabilizing leg.", "Repeat and switch ankles." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "hip abductors" ],
  "equipment" : [ "cable" ],
  "images" : [ "\"hip-adduction-medium-1.png\"", "\"hip-adduction-medium-2.png\"" ]
}, {
  "title" : "Step Ups with Barbell",
  "description" : "This exercise builds coordination as well as muscle.",
  "types" : [ "compound" ],
  "steps" : [ "Place a bench, box or step in front of you.", "Grasp a barbell with a wide grip and place it across your shoulders.", "With your left leg, step up on the bench, and follow by stepping up with your right leg.", "Step down with your left leg and then your right leg.", "Repeat starting with your right leg." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"step-ups-with-barbell-medium-1.png\"", "\"step-ups-with-barbell-medium-2.png\"", "\"step-ups-with-barbell-medium-3.png\"" ]
}, {
  "title" : "Lying Leg Curl Machine",
  "description" : "This is an exercise for hamstring strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie face down on a leg curl machine and place your heels under the roller pad.", "Grasp the grips with your hands for support and slowly curl your ankles up towards your back.", "Hold for a moment and then return to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "hamstring" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"lying-leg-curl-machine-medium-1.png\"", "\"lying-leg-curl-machine-medium-2.png\"" ]
}, {
  "title" : "Flutter Kicks",
  "description" : "This is an exercise for quadriceps and hamstring strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie face down on a bench with your hips on the edge, hold onto the bench with your hands.", "Allow your legs and toes hang down.", "Draw your abs in, squeeze your gluts and hamstrings.", "Kick each back and up while keeping your hips on the bench.", "Alternate kicking each leg." ],
  "primaryMusclGroup" : [ "hamstrings" ],
  "secondaryMuscleGroup" : [ "quadriceps" ],
  "equipment" : [ "flat bench" ],
  "images" : [ "\"flutter-kicks-medium-1.png\"", "\"flutter-kicks-medium-2.png\"" ]
}, {
  "title" : "Dumbbell Lunges",
  "description" : "This is an exercise for whole leg but mainly hamstring strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a dumbbell in each hand.", "Stand with your feet about 8 inches apart, toes facing forward.", "Take a step forward (2-3 feet) keeping your abs drawn in and your upper body straight.", "Slowly lower one knee down as if kneeling while keeping your other knee bent at a 90 degree angle, do not let your knee touch the ground.", "Lower your body so that the rear knee is just above the floor and hold for a moment before returning to the starting position.", "Repeat on opposite side." ],
  "primaryMusclGroup" : [ "hamstring" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "quadriceps" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"dumbbell-lunges-medium-1.png\"", "\"dumbbell-lunges-medium-2.png\"" ]
}, {
  "title" : "Barbell Lunges",
  "description" : "This is a classic exercise used for strengthening the hamstrings, quadriceps, calves and gluts.",
  "types" : [ "isolation" ],
  "steps" : [ "Start by placing a barbell across your upper back, using a grip slightly wider than your shoulders.", "Stand with your feet about 8 inches apart, toes facing forward.", "Take a step forward (2-3 feet) keeping your abs drawn in and your upper body straight.", "Slowly lower one knee down as if kneeling while keeping your other knee bent at a 90 degree angle, do not let your knee touch the ground.", "Lower your body so that your rear knee is just above the floor and hold for a moment before returning to the starting position.", "Repeat on other side." ],
  "primaryMusclGroup" : [ "hamstring" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "quadriceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"barbell-lunges-medium-1.png\"", "\"barbell-lunges-medium-2.png\"" ]
}, {
  "title" : "Upright Band Rows",
  "description" : "This is an exercise for lats, triceps and shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand on the band so that the handles are level with your upper thigh.", "With your back straight and abs drawn in raise your hands upward to your collarbone.", "Your elbows and arms should be parallel with the floor.", "Slowly lower your arms and return to starting position." ],
  "primaryMusclGroup" : [ "lats" ],
  "secondaryMuscleGroup" : [ "shoulders", "triceps" ],
  "equipment" : [ "bands", "body" ],
  "images" : [ "\"upright-band-rows-medium-1.png\"", "\"upright-band-rows-medium-2.png\"" ]
}, {
  "title" : "One Arm Flat Bench Fly’s",
  "description" : "This is an exercise for chest strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with your free hand holding the bench.", "Grasp the dumbbell in your other hand and with your forearm parallel to the floor raise your arm in an arc the middle of your chest.", "Once the dumbbell is at the middle of your chest line, slowly lower is along the same path to starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "chest" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbell", "flat bench" ],
  "images" : [ "\"one-arm-flat-bench-flys-medium-1.png\"", "\"one-arm-flat-bench-flys-medium-2.png\"" ]
}, {
  "title" : "Internal Cable Rotation",
  "description" : "This is an exercise for shoulder and biceps strengthening.",
  "types" : [ "compound" ],
  "steps" : [ "Sit on the floor with your body close to low cable pulley.", "Grasp the pulley with your left arm and position your elbow bent at 90 degree angle.", "Pull the cable towards your body and internally rotate your shoulder until your forearm is across your abs.", "Return to starting position.", "Repeat with right arm." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps" ],
  "equipment" : [ "cable machine" ],
  "images" : [ "\"internal-cable-rotation-medium-1.png\"", "\"internal-cable-rotation-medium-2.png\"" ]
}, {
  "title" : "Bent Over Rear Deltoid Raise With Head On Bench",
  "description" : "This is an exercise for shoulder strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Rest your forehead on an incline bench in oder to stabilise your movements so you are bent over with your back parallel to the floor, draw your abs in.", "Grasp dumbbells in your hands with your arms straight and elbows slightly bent ensuring they are not locked.", "Slowly raise the dumbbells up to shoulder height.", "Pause for a moment and then return to the starting position.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"bent-over-rear-deltoid-raise-with-head-on-bench-medium-1.png\"", "\"bent-over-rear-deltoid-raise-with-head-on-bench-medium-2.png\"" ]
}, {
  "title" : "Back Fly’s with Exercise Band",
  "description" : "This is an exercise for shoulder, middle back and triceps strengthening.",
  "types" : [ "isolation" ],
  "steps" : [ "Place an exercise band around a post or machine at mid chest height.", "Stand with your feet shoulder width apart, abs drawn in and knees slightly bent.", "Stand back from the post so there is tension in the band, grasping the band with your arms extended in front of you and a slight bend in your elbows; this is your starting position.", "Bring your arms back in a controlled motion till they are parallel at your sides and in line with your shoulders.", "Slowly return your arms to the starting position in front of your chest.", "Repeat." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "middle back", "triceps" ],
  "equipment" : [ "exercise band" ],
  "images" : [ "\"back-flys-with-exercise-band-medium-1.png\"", "\"back-flys-with-exercise-band-medium-2.png\"" ]
}, {
  "title" : "Romanian Dead Lift",
  "description" : "This is an exercise similar to the regular dead lift and strengthens the hamstring, calves, quadriceps and gluts.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a barbell in front of your feet on the ground.", "Grasp the barbell with a grip a bit wider than shoulder width apart.", "Bend your knees slightly, keeping your hips and back straight.", "Lift the bar straight up concentrating on using your hips as you stand.", "Stand with the bar resting against your thighs.", "Lower the bar to the floor with a slight bend in your knees flexing your hips back for stability." ],
  "primaryMusclGroup" : [ "hamstrings" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "quadriceps" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"romanian-dead-lift-medium-1.png\"", "\"romanian-dead-lift-medium-2.png\"" ]
}, {
  "title" : "Seated Leg Curl",
  "description" : "This is an exercise for hamstring strengthening which is similar to the laying leg curls.",
  "types" : [ "isolation" ],
  "steps" : [ "Adjust the machine so that the footpad is just above your heels.", "Sit upright with your abs drawn in and your legs in front of you.", "Slowly curl your legs back towards you and hold for a moment.", "With controlled movement return to the starting position." ],
  "primaryMusclGroup" : [ "hamstrings" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "machine" ],
  "images" : [ "\"seated-leg-curl-medium-1.png\"", "\"seated-leg-curl-medium-2.png\"" ]
}, {
  "title" : "Squat to Bench with Barbell",
  "description" : "This is s great overall exercise for the lower body. There are many variations on the squat, this one uses a bench to remind you how far down to squat.",
  "types" : [ "compound" ],
  "steps" : [ "Place a bench behind you.", "Lifting a barbell off of a weight rack, position it on your shoulders.", "Place your feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in, descend slowly and squat down, bending at the knees and hips.", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance). Do not sit on the bench.", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"squat-to-bench-with-barbell-medium-1.png\"", "\"squat-to-bench-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Single Leg Squat with Barbell",
  "description" : "This is an advanced exercise and modification of the basic squat. Mastery of the squat is recommended before attempting this exercise.",
  "types" : [ "compound" ],
  "steps" : [ "Place a barbell on your back, above your shoulders with a wide grip.", "Cross the lower leg above the knee of your supporting leg (the leg you will squat with).", "Squat down as low as you are able.", "Slowly return to an upright position by straightening your hip and knee.", "Switch legs and repeat." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"single-leg-squat-with-barbell-medium-1.png\"", "\"single-leg-squat-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Side Squats with Barbell",
  "description" : "This version of a squat works the hip adductors, helping build better core strength and coordination.",
  "types" : [ "compound" ],
  "steps" : [ "Place a barbell on your shoulders and grasp it with a wide grip.", "Stand with your feet wide apart, with the foot of the leg you will be leaning towards angled out.", "Bring your lower body to your foot by bending the hip and knee of your lead leg, and keeping your other leg fairly straight.", "Return to the starting position and switch legs." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "hamstrings", "hip abductors" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"side-squats-with-barbell-medium-1.png\"", "\"side-squats-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Squats using Dumbbells",
  "description" : "This is a great overall exercise for the lower body that uses dumbbells instead of a barbell. Beginners may find this version easier to perform.",
  "types" : [ "compound" ],
  "steps" : [ "Grasp a dumbbell in each hand.", "Stand with feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstring" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"squats-using-dumbbells-medium-1.png\"", "\"squats-using-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Rear Lunges with Dumbbell",
  "description" : "This is an advanced version of a lunge.",
  "types" : [ "compound" ],
  "steps" : [ "Grasp a dumbbell in each hand.", "Stand with your feet approximately 8 inches apart with your toes pointing forward.", "Slowly take a step backward with your right leg.", "Keeping your abs drawn in and your upper body straight, lower your body until your left knee is almost on the ground. You may choose to place a mat or towel under your knee.", "Hold for a moment and then return to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "hamstrings", "hip abductors" ],
  "equipment" : [ "dumbbells" ],
  "images" : [ "\"rear-lunges-with-dumbbell-medium-1.png\"", "\"rear-lunges-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Rear Lunges with Barbell",
  "description" : "This is an advanced version of a lunge.",
  "types" : [ "compound" ],
  "steps" : [ "Place a barbell on a rack at chest height.", "Lift the barbell of of the rack and onto your shoulders, gripping the bar slightly wider than shoulder width apart.", "Stand with your feet approximately 8 inches apart with your toes pointing forward.", "Slowly take a step backward with your right leg.", "Keeping your abs drawn in and your upper body straight, lower your body until your left knee is almost on the ground. You may choose to place a mat or towel under your knee.", "Hold for a moment and then return to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "hamstrings", "hip abductors" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"rear-lunges-with-barbell-medium-1.png\"", "\"rear-lunges-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Leg Press",
  "description" : "Along with the Squat, this exercise is crucial for building and strengthening the legs.",
  "types" : [ "compound" ],
  "steps" : [ "Adjust the seat of the machine so that your feet comfortably reach the crosspiece with a slight bend in your knees.", "To begin, press your feet forward at a shoulder width stance and release the safety locks.", "Slowly lower the weight towards your body, keeping your abs drawn in and your knees moving in the same direction as your feet to a 90 degree angle.", "Do not lock your knees or bounce the weight." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "hamstrings" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"leg-press-medium-1.png\"", "\"leg-press-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Hack Squat",
  "description" : "This is another variation of the basic Squat that focuses primarily on the quadriceps, or thigh muscles, while using the Smith Machine.",
  "types" : [ "compound" ],
  "steps" : [ "Adjust the bar to a low setting just above your ankles.", "Stand with the bar on the floor just behind your legs, with your feet shoulder width apart and your toes pointing forward.", "With your feet firmly placed on the floor reach down and grasp the bar from behind, with an overhand grip.", "Lift the bar by extending your hips and knees, taking care not to lock your knees.", "Lower yourself (squat) down until your thighs are parallel to the floor.", "Slowly raise yourself up to starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "gluts", "hamstrings" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-hack-squat-medium-1.png\"", "\"smith-machine-hack-squat-medium-2.png\"" ]
}, {
  "title" : "Walking Lunges",
  "description" : "A walking lunge gives you the benefit of lunges plus core muscle training from the constant motion.",
  "types" : [ "isolation" ],
  "steps" : [ "Start by either placing a barbell across your upper back or by grasping a dumbbell in each hand.", "Stand with your feet about 8 inches apart, toes facing forward.", "Take a lunge forward keeping your abs drawn in and your upper body straight.", "Slowly lower one knee down as if kneeling while keeping your other knee bent at a 90 degree angle, do not let your knee touch the ground.", "Lower your body to just above the floor and hold for a moment before pushing off with the back foot.", "Step through and repeat the exercise with the other leg." ],
  "primaryMusclGroup" : [ "hamstrings" ],
  "secondaryMuscleGroup" : [ "calves", "gluts", "quadriceps" ],
  "equipment" : [ "barbell or dumbbell" ],
  "images" : [ "\"walking-lunges-medium-1.png\"", "\"walking-lunges-medium-2.png\"", "\"walking-lunges-medium-3.png\"", "\"walking-lunges-medium-4.png\"" ]
}, {
  "title" : "Ball Wall Circles",
  "description" : "This is an exercise to strengthen and stretch the rotator cuff muscles or shoulder muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Stand upright with your feet shoulder width apart.", "Place a Swiss ball at chest height against a wall and with your left hand, roll the ball in small circles against the wall.", "Keep your arm fully extended with a slight bend in the elbow.", "Reverse the direction of the circles.", "Switch arms." ],
  "primaryMusclGroup" : [ "shoulders" ],
  "secondaryMuscleGroup" : [ "biceps", "triceps" ],
  "equipment" : [ "swiss ball" ],
  "images" : [ "\"ball-wall-circles-medium-1.png\"", "\"ball-wall-circles-medium-2.png\"" ]
}, {
  "title" : "Zecher Squats",
  "description" : "This variation of squat is similar to a Front Squat, it works to build the upper muscles of the quadriceps (thighs).",
  "types" : [ "compound" ],
  "steps" : [ "Lift a barbell off of a weight rack and place across your chest. Hold the barbell with your arms crossed.", "Place your feet slightly wider than shoulder width apart with your knees and toes pointed slightly outward.", "Drawing your abs in, descend slowly by bending at the knees and hips as if you are sitting down (squatting).", "Lower yourself as far as you can control without letting your body shift towards your toes (this will cause you to loose balance).", "Pause in the downward position and slowly return upright to the starting position." ],
  "primaryMusclGroup" : [ "quadriceps" ],
  "secondaryMuscleGroup" : [ "calves", "glutes", "hamstrings" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"zecher-squats-medium-1.png\"", "\"zecher-squats-medium-2.png\"" ]
}, {
  "title" : "Triceps Pushdown with Rope and Cable",
  "description" : "This version of the triceps pushdown uses a rope for better definition in the muscle.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand in front of a cable machine and attach a rope to a high pulley.", "Grasp the rope with palms facing down.", "Draw your abs in and keep your back straight.", "Keeping your elbows at your side push the rope down towards your thighs, if possible “split” the rope apart at the bottom.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"triceps-pushdown-with-rope-and-cable-medium-1.png\"", "\"triceps-pushdown-with-rope-and-cable-medium-2.png\"" ]
}, {
  "title" : "Seated Triceps Press with Dumbbell",
  "description" : "This exercise uses a single dumbbell held between both hands to work the triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on a short, straight backed bench with your feet planted firmly on the floor.", "Drawing your abs in, grasp the dumbbell with both hands with a palms up grip.", "Raise the weight over your head, this is your starting position.", "Lower the dumbbell in an arc from above your head to behind your back.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"seated-triceps-press-with-dumbbell-medium-1.png\"", "\"seated-triceps-press-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Seated Overhead Triceps Extension with Barbell",
  "description" : "This exercise uses a barbell behind your neck to isolate the triceps effectively.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on a short straight back chair with your feet firmly placed on the floor and your back straight.", "Grasp an EZ or Curl bar, or barbell with a grip about 6 inches apart.", "Raise the bar to arms length above your head and then lower the bar in an arc towards the floor behind your head.", "Return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"seated-overhead-triceps-extension-with-barbell-medium-1.png\"", "\"seated-overhead-triceps-extension-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Seated Two-Arm Triceps Extension with Dumbbell",
  "description" : "This exercise is the two handed version of seated triceps extension.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the edge of a bench with your feet flat on the floor.", "Hold a dumbbell in each hand.", "Bring your arms up to your side so the dumbbell is almost parallel to your chest, keeping your lower arm vertical.", "Press your arm back in arc towards your back.", "Return to the starting position repeat and switch arms." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"seated-two-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"seated-two-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Seated One Arm Triceps Extension with Dumbbell",
  "description" : "This exercise uses a kickback movement to work the triceps in each arm individually.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on the edge of a bench with your feet flat on the floor.", "Hold a dumbbell in your right hand.", "Bring your right arm up to your side so the dumbbell is almost parallel to your chest, keeping your lower arm vertical.", "Press your arm back in arc.", "Return to the starting position repeat and switch arms." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"seated-one-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"seated-one-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Reverse Triceps Bench Press with Barbell",
  "description" : "This exercise is a version of the Bench Press that specifically isolates the triceps.",
  "types" : [ "compound" ],
  "steps" : [ "Lie on a flat bench with your head at one end and your feet placed firmly on the floor.", "Grasp a barbell with palms facing your head about 16 inches apart.", "Move the bar over your chest (about 1 inch below your nipples).", "Extend your arms fully raising the bar fully and then lower the bar to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"reverse-triceps-bench-press-with-barbell-medium-1.png\"", "\"reverse-triceps-bench-press-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Reverse Grip Triceps Pushdown",
  "description" : "This exercise is the reverse version of the triceps pushdown.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand in front of a cable machine and attach a bar to a high pulley.", "Grasp the handle with palms facing up.", "Keeping your elbows at your side, pull the handle down towards your thighs.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"reverse-grip-triceps-pushdown-medium-1.png\"", "\"reverse-grip-triceps-pushdown-medium-2.png\"" ]
}, {
  "title" : "Close Triceps Pushup",
  "description" : "This version of the Pushup isolates the tricep (back of the arm) muscles.",
  "types" : [ "compound" ],
  "steps" : [ "Kneel down on the floor or a mat, placing your hand thumbs together and raise your up on your toes.", "Draw your abs in and keep your back and neck in a straight line.", "Slowly lower your body towards the floor, by bending your arms, until you are nearly touching the floor.", "In a controlled manner raise your body back up to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest" ],
  "equipment" : [ "body" ],
  "images" : [ "\"close-triceps-pushup-medium-1.png\"", "\"close-triceps-pushup-medium-2.png\"" ]
}, {
  "title" : "Single Arm Supinated Triceps Extension with Dumbbell",
  "description" : "This exercise is similar to the Single Arm Pronated Triceps Extension except the movement is over the head instead of across the chest.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat in a bench with your head at one end and your feet placed firmly on the floor.", "Grasp a dumbbell in one hand and raise it to a position above your chest, with your palm facing the floor.", "Place your free hand under the shoulder to support your other arm. Slowly bend your elbow over your head with the weight moving only your forearm and elbow.", "Return to the starting position and repeat with your other arm." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"single-arm-supinated-triceps-extension-with-dumbbell-medium-1.png\"", "\"single-arm-supinated-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Single Arm Pronated Triceps Extension with Dumbbell",
  "description" : "This is an advanced exercise to isolate and work the tricep (back of the arm) muscles.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat in a bench with your head at one end and your feet placed firmly on the floor.", "Grasp a dumbbell in one hand and raise it to a position above your chest, with your palm facing your feet.", "Place your free hand under the shoulder to support your other arm.", "Slowly lower the weight moving only your forearm and elbow towards and away from your chest.", "Repeat with your other arm." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"single-arm-pronated-triceps-extension-with-dumbbell-medium-1.png\"", "\"single-arm-pronated-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Smith Machine Close Grip Bench Press",
  "description" : "This version of a Bench Press uses a close grip to isolate the triceps as well as working the chest.",
  "types" : [ "compound" ],
  "steps" : [ "Place a flat bench in the middle of a Smith Machine.", "Using a close grip (about 6 inches apart) unlatch the bar and lower it towards your chest.", "Pause just before the bar hits your chest and raise the bar by extending your arms to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest" ],
  "equipment" : [ "smith machine" ],
  "images" : [ "\"smith-machine-close-grip-bench-press-medium-1.png\"", "\"smith-machine-close-grip-bench-press-medium-2.png\"" ]
}, {
  "title" : "Bent-Over One Arm Triceps Extension with Dumbbell",
  "description" : "This exercise uses a kickback movement to work the triceps in each arm individually.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your abs drawn in and your back straight as you bend at the waist.", "Hold a dumbbell in your right hand.", "Bring your right arm up to your side so the dumbbell is almost parallel to your chest, keeping your lower arm vertical and press your arm back in arc.", "Return to the starting position repeat and switch arms." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"bent-over-one-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"bent-over-one-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Triceps Pushdown with Cable",
  "description" : "This exercise is the original version of the triceps pushdown.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand in front of a cable machine and attach a short bar to a high pulley.", "Grasp the handle with your palms facing down.", "Draw your abs in and keep your back straight.", "Keeping your elbows at your side push the handle down towards your thighs.", "Pause for a moment and then return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"triceps-pushdown-with-cable-medium-1.png\"", "\"triceps-pushdown-with-cable-medium-2.png\"" ]
}, {
  "title" : "Triceps Kickback with Dumbbell",
  "description" : "This along with the Triceps Push Down is one of the most beneficial exercises for the arms.",
  "types" : [ "isolation" ],
  "steps" : [ "Standing along side a flat bench, bend your left knee and place it on the bench.", "Place your left hand on the bench for support, keeping your back at a 45 degree angle.", "Hold a dumbbell in your right hand and place your right foot on the floor.", "Bend your right arm and raise it up to your shoulder, then with controlled motion kick it back, fully extending your arm.", "Switch arms and repeat." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"triceps-kickback-with-dumbbell-medium-1.png\"", "\"triceps-kickback-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Tate Press with Dumbbell",
  "description" : "This is an advanced triceps exercise which moves the muscle differently than other exercises.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay flat on a bench with your head at one end and your feet firmly planted on the floor.", "Hold a dumbbell in each hand so your palms are facing your feet.", "Drawing your abs in and keeping your back on the bench, raise the weights to the center of your chest.", "Without moving elbows, slowly raise your arms up and out contracting your triceps." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"tate-press-with-dumbbell-medium-1.png\"", "\"tate-press-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Standing Triceps Extension with Towel",
  "description" : "This exercise requires another person and uses manual resistance, or your body’s own weight to build muscle.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your back straight and your abs drawn in.", "Hold a towel or rope facing up behind and in back of your head.", "Have a partner hold the towel taught during the exercise so the resistance is constant.", "Lower your forearms down until they reach your biceps, then slowly raise your arms back up to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "body" ],
  "images" : [ "\"standing-triceps-extension-with-towel-medium-1.png\"", "\"standing-triceps-extension-with-towel-medium-2.png\"" ]
}, {
  "title" : "Standing Overhead Triceps Extension with Barbell",
  "description" : "This is a double arm barbell version of a behind the neck triceps exercise.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your back straight and your abs drawn in.", "Hold a barbell or EZ Curl bar about 6-8 inches apart with your palms facing up.", "Raise the bar over your head and slowly lower the dumbbell in an arc behind your head, towards your back.", "Slowly raise the bar back up to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"standing-overhead-triceps-extension-with-barbell-medium-1.png\"", "\"standing-overhead-triceps-extension-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Standing One Arm Triceps Extension with Dumbbell",
  "description" : "This is a single arm version of a behind the neck triceps exercise.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your back straight and your abs drawn in.", "Hold a dumbbell in your right hand with your palms facing up.", "Raise the dumbbell over your head and slowly lower the dumbbell in an arc behind your head, so that the dumbbell lines up with your spine.", "Slowly raise the dumbbell back up to the starting position.", "Switch arms and repeat." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbell" ],
  "images" : [ "\"standing-one-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"standing-one-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "One Arm Low-Pulley Triceps Extension with Cable",
  "description" : "This exercise uses a cable machine to isolate the triceps.",
  "types" : [ "compound" ],
  "steps" : [ "Attach a handle to a low cable pulley machine.", "Stand with your back to the weight stack, your feet shoulder width apart.", "With your left hand, reach behind you and grasp the handle.", "Place your right hand on your left elbow for support.", "Extend your left arm straight up towards the ceiling and then lower it to the starting position.", "Repeat and switch arms." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"one-arm-low-pulley-triceps-extension-with-cable-medium-1.png\"", "\"one-arm-low-pulley-triceps-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "Standing Triceps Extension",
  "description" : "This exercise works the triceps by reaching behind your neck.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your back straight and your abs drawn in.", "Hold a dumbbell in both hands, with your palms facing up.", "Raise the dumbbell over your head and slowly lower the dumbbell in an arc behind your head.", "Slowly raise the dumbbell back up to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"standing-triceps-extension-medium-1.png\"", "\"standing-triceps-extension-medium-2.png\"" ]
}, {
  "title" : "Bent-Over Two Arm Triceps Extension with Dumbbell",
  "description" : "This exercise uses a kickback movement to work the triceps in each arm individually.",
  "types" : [ "isolation" ],
  "steps" : [ "Stand with your feet shoulder width apart, your abs drawn in and your back straight as you bend at the waist until your upper body is parallel to the floor.", "Hold a dumbbell in each hand.", "Bring your right arm up to your side so the dumbbell in line with your chest, keeping your lower arm vertical and press your arm back in arc.", "Return to the starting position repeat and switch arms." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"bent-over-two-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"bent-over-two-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Old School Reverse Extensions",
  "description" : "As the name suggests, this is an old classic exercise that hits the triceps hard.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie down on a bench, on your back, with your head at one end.", "Grasp a barbell with an underhand grip.", "Move your arms beyond your head, keeping them in a straight line.", "Bending only your elbows, slowly lower and raise the barbell." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"old-school-reverse-extensions-medium-1.png\"", "\"old-school-reverse-extensions-medium-2.png\"" ]
}, {
  "title" : "Lying Two Arm Triceps Extension with Dumbbell",
  "description" : "This a lying version of a Triceps Kickback.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on a bench, on your back, with your head at one end.", "Grasp a dumbbell in each hand and raise them at arms length over your shoulders.", "Lower the dumbbells in an arc bending your elbows until your forearms are touching your biceps.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"lying-two-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"lying-two-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Lying Triceps Press with Barbell",
  "description" : "This is another classic exercise for building the triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench with your head at one end.", "Grasp an EZ or Curl bar with an overhand grip.", "Raise the bar straight up over your shoulders, taking care to keep your elbows in close.", "Slowly lower the bar in an arc over your head.", "Return the bar to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"lying-triceps-press-with-barbell-medium-1.png\"", "\"lying-triceps-press-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Tricep Dips using Machine",
  "description" : "This exercise uses a machine to work the triceps while in seated position.",
  "types" : [ "compound" ],
  "steps" : [ "Adjust the seat of the machine so that the handles are equal with your elbows.", "Grasping the handles, press down with equal pressure until your arms are fully extended.", "Pause, and then return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "machine" ],
  "images" : [ "\"tricep-dips-using-machine-medium-1.png\"", "\"tricep-dips-using-machine-medium-2.png\"" ]
}, {
  "title" : "Decline EZ Bar Triceps Extension with Barbell",
  "description" : "This exercise combines a decline bench and a curved bar to more efficiently work the triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay face up on a decline bench and grasp an EZ Bar (Curved Barbell).", "Extend your arms so they are perpendicular to your chest, and keeping your elbows in one place, lower the bar toward your head.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"decline-ez-bar-triceps-extension-with-barbell-medium-1.png\"", "\"decline-ez-bar-triceps-extension-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Decline Triceps Extension with Dumbbell",
  "description" : "This exercise combines a decline bench and dumbbells to target the triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay face up on a decline bench with a dumbbell in each hand.", "Extend your arms so they are perpendicular to your chest, and keeping your elbows in one place, lower your hands so the dumbbells are lowered near your head.", "Slowly return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"decline-triceps-extension-with-dumbbell-medium-1.png\"", "\"decline-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Decline Close Grip Bench to Skull Crusher",
  "description" : "This exercise combines a close grip bench press with triceps extension.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay with your back on a flat bench.", "Grip a barbell with a close grip 8-12 inches apart.", "Keeping your arms close to your sides lower the bar so it touches your chest, approximately an inch below your nipples.", "Slowly return to starting position, concentrating on your triceps.", "At the top of the exercise bend your arms down towards your head.", "Raise the bar back up over your chest and repeat." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"decline-close-grip-bench-to-skull-crusher-medium-1.png\"", "\"decline-close-grip-bench-to-skull-crusher-medium-2.png\"" ]
}, {
  "title" : "One Arm Tricep Extension with Cable",
  "description" : "This exercise isolates the triceps muscles individually.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a cable pulley on the highest setting and adjust a stirrup handle to the pulley.", "Stand facing the weight stack and grasp the handle with and underhand grip.", "Keep your back straight, your abs drawn in and your knees slightly bent.", "Starting at the top, push your arm down until it is straight, feeling the concentration in your tricep.", "Slowly return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"one-arm-tricep-extension-with-cable-medium-1.png\"", "\"one-arm-tricep-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "Lying Tricep Extension with Cable",
  "description" : "This exercise uses cables to isolate and work the triceps (muscles on the back of the arms).",
  "types" : [ "isolation" ],
  "steps" : [ "Place a flat bench with the end towards a weight stack.", "Attach a short straight bar to the pulley and lower the pulley to the bottom of the stack.", "Lie face up on the bench and grasp the bar with a narrow overhand grip.", "Starting with your arms extended lower the bar towards the bar towards the stack by bending your elbows.", "Slowly extend your arms upright and return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"lying-tricep-extension-with-cable-medium-1.png\"", "\"lying-tricep-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "Incline Triceps Extension with Cable",
  "description" : "This exercise uses cables to isolate and work the triceps (muscles on the back of the arms).",
  "types" : [ "isolation" ],
  "steps" : [ "Place an incline bench facing away from a cable pulley.", "Attach a short straight bar to the pulley and adjust the height so that your arms can extend fully.", "Lie face up on the bench and grasp the bar with a narrow overhand grip.", "Starting with your elbows bent overhead, slowly lower the bar towards your feet.", "Pause at the bottom and then return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"incline-triceps-extension-with-cable-medium-1.png\"", "\"incline-triceps-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "Incline Pushdown with Cable",
  "description" : "This exercise uses cables to isolate and work the triceps (muscles on the back of the arms).",
  "types" : [ "isolation" ],
  "steps" : [ "Place an incline bench facing away from a cable pulley.", "Attach a short straight bar to the pulley and adjust the height so that your arms can extend fully.", "Lie face up on the bench and grasp the bar with a narrow overhand grip.", "Keeping your arms straight, slowly push the bar down towards your feet.", "Pause at the bottom and then return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"incline-pushdown-with-cable-medium-1.png\"", "\"incline-pushdown-with-cable-medium-2.png\"" ]
}, {
  "title" : "Tricep Dips using Body Weight",
  "description" : "This classic exercise uses the weight of your own body to work your triceps.",
  "types" : [ "compound" ],
  "steps" : [ "Grasp a set of parallel bars and push yourself up to the starting position.", "Keeping your elbows close to your body, lower yourself down until your triceps are parallel to the floor.", "Slowly raise yourself back to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest", "shoulders" ],
  "equipment" : [ "body" ],
  "images" : [ "\"tricep-dips-using-body-weight-medium-1.png\"", "\"tricep-dips-using-body-weight-medium-2.png\"" ]
}, {
  "title" : "One Arm Triceps Extension with Dumbbell",
  "description" : "This exercise uses a dumbbell to work each arm individually.",
  "types" : [ "isolation" ],
  "steps" : [ "Sit on a bench with your back straight and your abs drawn in.", "Grasp a dumbbell in your hand and place it behind your neck with your elbow bent.", "Slowly extend your arm straight up over your head and slowly return to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"one-arm-triceps-extension-with-dumbbell-medium-1.png\"", "\"one-arm-triceps-extension-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Lying Triceps Extension Across Face with Dumbbell",
  "description" : "This is an advanced exercise and should be avoided by beginners.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay on a flat bench with your head at one end and your feet planted firmly on the floor.", "Grasp a dumbbell in each hand with palms facing up.", "Raise dumbbells over your body. Your arms will be pointed towards the ceiling.", "While keeping your upper arms and elbows still, lower the dumbbell slowly over your face bending only your elbow.", "Slowly raise the dumbbell back to the starting position and repeat with your other arm." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"lying-triceps-extension-across-face-with-dumbbell-medium-1.png\"", "\"lying-triceps-extension-across-face-with-dumbbell-medium-2.png\"" ]
}, {
  "title" : "Lying Triceps Extension with Dumbbells",
  "description" : "This exercise uses gravity to increase the resistance of the weight.",
  "types" : [ "isolation" ],
  "steps" : [ "Lay on a flat bench with your head at one end and your feet planted firmly on the floor.", "Grasp a dumbbell with both hands with palms facing up.", "Raise dumbbell over your body. Your arms will be pointed towards the ceiling.", "While keeping your upper arms and elbows still, lower the dumbbell in an arc behind your head.", "Slowly raise the dumbbell back to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "dumbbell" ],
  "images" : [ "\"lying-triceps-extension-with-dumbbells-medium-1.png\"", "\"lying-triceps-extension-with-dumbbells-medium-2.png\"" ]
}, {
  "title" : "Lying Close Grip Triceps Press to Chin with Barbell",
  "description" : "This exercise is a classic for building the triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie on a flat bench on your back, with your head at one end.", "Grasp a bar with a close grip, approximately 6 inches apart.", "Raise the bar straight up over your shoulders, keeping your elbows close in.", "Slowly lower the bar in an arc towards your chin.", "Return the bar to the starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"lying-close-grip-triceps-press-to-chin-with-barbell-medium-1.png\"", "\"lying-close-grip-triceps-press-to-chin-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Lying Close-Grip Triceps Extension Behind the Head with Barbell",
  "description" : "You can use a barbell or EZ (curl) bar to further concentrate the benefit to your triceps.",
  "types" : [ "isolation" ],
  "steps" : [ "Lie flat on a bench on your back.", "Grasp the bar with a grip approximately 8 inches apart and lower the bar behind your head.", "Keeping the bar parallel with the floor, bend your arms down in an arc so the bar moves in a direction under your head.", "Slowly return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"lying-close-grip-triceps-extension-behind-the-head-with-barbell-medium-1.png\"", "\"lying-close-grip-triceps-extension-behind-the-head-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Low Triceps Extension with Cable",
  "description" : "This exercise is done while lying on a seated row station.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a rope to the cable pulley at of a seated row station.", "Lie on your back on the bench with your head facing the weight stack.", "Grasp the rope with your palms facing each other and raise your arms over your chest, with your forearms parallel to the floor at a 90 degree angle.", "Slowly extend your arms upward squeezing your triceps.", "Return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"low-triceps-extension-with-cable-medium-1.png\"", "\"low-triceps-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "Kneeling Triceps Extension with Cable",
  "description" : "Kneeling allows you to isolate your triceps more effectively.",
  "types" : [ "isolation" ],
  "steps" : [ "Place a bench sideways in front of a high pulley machine.", "Grasp a straight bar with an over head grip.", "Kneel on the floor in front of the bench with your back straight and your head down.", "With your elbows and forearms above your head, push the bar down in an arc so that your forearms are touching the bench." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"kneeling-triceps-extension-with-cable-medium-1.png\"", "\"kneeling-triceps-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "Kneeling Triceps Concentration Extension with Cable",
  "description" : "Concentration exercises limit your range of movement to increase the effectiveness of the movement.",
  "types" : [ "isolation" ],
  "steps" : [ "Attach a stirrup handle to a cable pulley and adjust the pulley up high.", "Kneeling on your left knee, with the left side of your body turned towards the machine, keep your right leg bent and the upper portion of your thigh parallel to the floor.", "With your right elbow and upper arm pressed against your inner thigh just above your knee, pull the cable down towards the floor in a slight arcing motion.", "Slowly to return to starting position.", "Repeat and switch arms." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "cable" ],
  "images" : [ "\"kneeling-triceps-concentration-extension-with-cable-medium-1.png\"", "\"kneeling-triceps-concentration-extension-with-cable-medium-2.png\"" ]
}, {
  "title" : "JM Press",
  "description" : "This exercise is named after the inventor, J.M. Blakley. This is an advanced exercise used by bodybuilders and power lifters to build explosive power in the triceps muscle (back of the arms).",
  "types" : [ "compound" ],
  "steps" : [ "Lay on a flat bench with your head just at the end of the bench.", "Grasp the bar with a medium overhand grip keeping your elbows close to your side, over your sternum (mid chest).", "Lower the bar towards your sternum at a regular pace, then pause for a moment.", "With a controlled but rapid pace, push the bar back to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "shoulders" ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"jm-press-medium-1.png\"", "\"jm-press-medium-2.png\"" ]
}, {
  "title" : "Incline Triceps Extension with Barbell",
  "description" : "This version of a triceps extension uses gravity to increase the resistance of the exercise.",
  "types" : [ "isolation" ],
  "steps" : [ "Grasp a barbell with a close grip (4-6 inches apart).", "Lie on an incline bench and hold the bar over your head.", "Lower your arms in a slight arc so your forearms are touching your biceps.", "Slowly return back to the starting position with the bar over your head." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ ],
  "equipment" : [ "barbell" ],
  "images" : [ "\"incline-triceps-extension-with-barbell-medium-1.png\"", "\"incline-triceps-extension-with-barbell-medium-2.png\"" ]
}, {
  "title" : "Bench Dips",
  "description" : "This exercise is one of the most basic and still one of the best for building the triceps (muscles on the back of the arm).",
  "types" : [ "compound" ],
  "steps" : [ "Place two benches parallel to each other 3-4 feet apart.", "Sit on one bench and place your feet on the edge of the other bench so that your legs are suspended between the 2 benches.", "Cross your feet for support.", "Hold onto the bench with your hands for support and slowly lower body towards the floor by bending your elbows.", "Pause and then return to starting position." ],
  "primaryMusclGroup" : [ "triceps" ],
  "secondaryMuscleGroup" : [ "chest" ],
  "equipment" : [ "body" ],
  "images" : [ "\"bench-dips-medium-1.png\"", "\"bench-dips-medium-2.png\"" ]
} ]